[
  {
    "title": "Product Owner / Designer",
    "url": "https://www.seek.com.au/job/58574191?type=promoted#sol=27594b15163af5a81a39144375676f11449bca18",
    "description": [
      "Here at Patient Zero we provide teams as a service to our many customers.Many customers = many interesting domains to work with. We are an agile organisation through and through. We don’t believe in hierarchies, only enablement of information flow through teams, ensuring you get the help you need, when you need it. We've created an environment where team members can thrive, working in small cross functional teams of 4 or 5 - you won’t find any lone wolves here. Teams are autonomous and accountable, with the support of the whole company and community behind them. Believe it or not, we do this as a customer-driven business (trying to avoid that ‘consultancy’ word that generally has people believing we are something we are not). What this means is that we have learning opportunities coming out of our ears. We’ve got many interesting domains and technologies to work with. We’re looking for people who are willing to learn new things when the opportunity arises. We are looking for experienced Product Designers / Owners / Senior BA's to join our growing team of professionals. About you:Hungry, humble and smart with the ability to elicit customer requirements and translate those into a cohesive and comprehensive backlog of epics, user stories and acceptance criteria.Prior BA experience, highly desirable. This role requires high attention to detail in requirements analysis and elicitation.The Sherlock Holmes of finding customer, end user and team value, as well as identifying and solving complex problems.A painter of pictures; through sketches, wireframes, diagrams or even high-fidelity designs.A people person, with the ability to have those hairy conversations if needed.An open book, sharing your knowledge and ideas to help grow our customers and our teams.Experience in agile delivery, optionally versed in scrum mastery What do you get when you join us here at PZ?A fun and inclusive culture with a strong focus on work life balanceAn extra 10% incentivisation on top of your base salary to use across tech funds and personal projects (incubator)Paid certifications in our partnership programsA bunch of learning groups & a personal growth planning program to advance your careerHybrid working, mostly remote, working 1day a fortnight in our CBD office (you can work from there more if you would like!) At PZ we work hard and play hard, doing loads of fun and exciting things to maintain our awesome culture. We love to celebrate our hard work and our many successes. Only shortlisted candidates will be contacted. Interviews will be arranged as soon as possible for suitable candidates/applications."
    ]
  },
  {
    "title": "Category Manager / Product Manager",
    "url": "https://www.seek.com.au/job/58550219?type=promoted#sol=c2f33b847defe739326a63d1e589865de74857ba",
    "description": [
      "OUR COMPANYWith our head office based in Brendale, North Brisbane, Yakima is dedicated to creating intuitive outdoor products that harness the spirit of adventure that connect you, your friends, family and all your favourite gear to your desired destination or activity.  Yakima is a world leader in designing and manufacturing automotive gear management and storage solutions which include vehicle roof racks, cargo boxes, platforms, rooftop tents, bike racks, mounts and so much more!  Yakima is dedicated to creating intuitive outdoor products to harness the spirit of adventure connecting you, your friends, family and all your favourite gear to your desired destination or activity.  Yakima is a world leader in designing and manufacturing automotive gear management and storage solutions, including vehicle roof racks, cargo boxes, platforms, rooftop tents, bike racks, mounts and so much more!At Yakima, you can make a difference. We foster an environment where we are passionate about our products, have fun at work and celebrate our achievements.  We share a strong sense of pride in our brands and have a passion for creating products that get people and gear outdoors to enjoy a healthy active lifestyle. We understand that true success is only achieved through a supportive and collaborative team environment.OUR OPPORTUNITYThe Category / Product Manager is responsible for effectively using product management methodologies to work closely with the team to deliver new product development and enhancements in our categories. This includes responsibility for the product roadmap, analysing consumer needs, current market trends and developing key potential partnerships.   You will play a key role in ensuring Yakima stays at the forefront of our segment of the automotive OEM and accessory market. You will be responsible for:Identifying opportunities in the market to support organisational strategic initiatives including category growth;Business case analysis of potential roadmap projects including sustaining current and new product initiatives;Preparing and presenting product briefs and specification documents for resourced roadmap initiatives for review by cross-functional project teams;Determining product pricing by utilising market research data, reviewing production and sales costs,  anticipating volume and costing special and customized orders;Sourcing of relevant products and working with manufacturers to bring those products to market;Post launch analysis of new products and assisting with product marketing strategies;Researching and recommending suppliers and performing product performance analysis;Leading, coaching and motivating the Product Coordinator to maximise potential.ABOUT YOUTo be successful in this role you will be able to think out of the box whilst still having attention to detail,  a genuine passion for our brands/products and the ability to work as a team player.  Key attributes include:Minimum of 2+ years of product management experience;Excellent project management and organisational skills;Demonstrated experience in planning, execution and delivery of product development strategies;Strong verbal, written and computer skills with the ability to liaise with stakeholders at all levels;Experience working within a fast paced and dynamic environment;Ability to exercise strong and mature judgement in both a technical and business environment;Integrity along with the ability to work autonomously or part of a team when required;Pragmatic attitude with proven problem solving skills and strong attention to detail;Valid Driver’s License and the willingness to travel when needed (and safe to do so);Above all a ‘can do’ attitude and a commitment to being part of a hardworking and successful team.Experience working in an aligned market including automotive and/or sports and leisure will be very highly regarded.WHAT WE CAN OFFER YOUYakima is a progressive and people-focused business which believes in developing and rewarding our people and their success.  Because we value our employees and their families, we offer an agile and flexible working environment with an emphasis on work life balance, and health and wellbeing.  You can expect an attractive salary package and as a valued employee you will have access to a wide range of exciting benefits, not least discounted products for yourself, family and friends.We are committed to recruiting, training and retaining high quality people.  If this role sounds like it’s made for you, we would love to hear from you!   We are keen to fill this role quickly, so don't delay in your application. Please apply with a current resume and a cover letter addressing your experience and skills against the criteria listed above.Yakima is an equal opportunity employer and we are proud of our diverse and open culture and people of all genders, nationalities and backgrounds are encouraged to apply.  Direct candidates only (no agencies). Must have unlimited rights to work in Australia."
    ]
  },
  {
    "title": "Senior Product Manager",
    "url": "https://www.seek.com.au/job/58504600?type=standout#sol=4194c2ff272b7a20007dba9dbbb818b9f4404d0b",
    "description": [
      "About the RoleWe currently have a rare and unique opportunity for an experienced Product Manager to take the next leap in their customer-focussed, data-driven product career across one of our core business verticals. As a Senior Product Manager, you are the visionary of the product and are responsible for creating, managing, and aligning the product delivery roadmap with the product strategy. In this role, you will be pivotal to the success of your product vertical, collaborating with a range of different business units to ensure the customer is at the centre of every decision we make. About YouYou pride yourself on the success of your product portfolio and have a customer-centric and revenue-based context behind all your decisions.You are transparent in maintaining the business value corresponding to each product feature, ensuring that every stakeholder understands progress and priorities. About UsWe’re Entain. Our vision is to be the world leader in sports and gaming entertainment. We are creating exciting and trusted experiences for our customers and revolutionising the gaming space as we go.Combining technology and entertainment to create products that push the boundaries, Entain is home to a global family of more than 25 well-known brands – names such as Ladbrokes Australia, neds, Bookmaker.com.au, betstar, and many more.Our growth and success have come from driving innovative and market-leading betting experiences developed in-house by our exceptional team. Key Responsibilities Define the product strategy and roadmap with Senior stakeholders. Drive the product delivery by defining Minimum Viable Products (MVPs) and factor in the customer feedback to scale, pivot, or stop. Engage in collaborative workshops such as discoveries and design sprints to help maintain the focus on customer value. Launch and support the user testing initiatives. Driving the Agile methodology adaptation in the Product space. Report on product performance, understanding key criteria for success.  Support product owners/managers to align their product development activities with the overall product development strategy. Full understanding of the market, the product, the product line and the competition and further understanding of new or existing products from talking with existing customers. Skills and Experience Demonstrated experience in a similar role executing product strategy and managing the product development lifecycle. Proven ability to manage a team of Product Managers with an understanding of continuous improvement and progression.  Strong customer focus and business acumen with an understanding of the target market and the ability to define the potential customer value per feature. Proven Agile experience within a cross-functional delivery team with strong stakeholder engagement skills.   Why work at Entain? Entain day's - we work a 9-day fortnight with every second Monday off! No expectation to work longer hours or take a reduction in pay. Meeting free Wednesday's. Potential to earn up to 20% bonus on top of your standard salary.  Genuinely flexible work arrangements with remote working and extended business hours to cater for your personal situation! Did you hear we have free coffee? Our Barista is onsite during business hours! Learning and development programs - Udemy & Oracle Learn. We LOVE Entertainment, and Racing and Sports are at heart of everything we do. So it only makes sense that we provide access to free and discounted tickets to sporting and racing events. For more information, please reach out to us at careers@entaingroup.com.au"
    ]
  },
  {
    "title": "Senior Product Manager",
    "url": "https://www.seek.com.au/job/58412196?type=standout#sol=b44ba5c0f613bcce1091b5d901d2d32c131dc01c",
    "description": [
      "About the Company:  This organisation creates industry-leading software that affects everyone in Australia. In the quest to create sustainable and valuable software solutions they have moved from being 'project-led' to truly 'product-led'. The organisation is now looking for a Product Manager who is passionate about their craft to join a highly engaged product team.   About the Role:  This is an opportunity for an experienced, systems-thinking Product Manager that enjoys solving complex problems, to join a cross-functional team in developing product solutions for a high-impact industry. Work on the Product from ideation and research, through to build, test and release.   Key Responsibilities:   Drive the product roadmap through discovery, strategy and delivery, ensuring products are solving problems and creating customer value Working closely with Product Squads you will be instrumental in the identification of improvements and implementation of new features which will greatly improve user experience Create and test product ideas through continuous experimentation with customers Analyse data to  draw insights and inform your product decisions, going through discovery processes that align usability, desirability and feasibility  Delivering in a complex environment you will need to have a solid understanding of the broader business and technical context to successfully deliver an impact for the organisation Identify and fill product gaps by eliciting, gathering and harnessing new ideas that grow market share, improve customer experience, and drive product growth Develop and communicate product roadmaps to illustrate how products are likely to grow across several product releases Drive collaboration and facilitate interdepartmental cooperation to deliver new and existing products, features and components through communication.   About You:  4 years working with technology-powered products as a Product Manager  Demonstrated experience with modern product discovery and delivery techniques  Proven ability to engage with engineers, designers and company leaders to develop constructive and collaborative relationships Combination of technical aptitude, commercial, and product management skills, communication, negotiation and decision-making ability You are passionate about discovery and product-led thinking, with the user at the heart of everything you do Ability to creatively solve problems with consideration of the business impact Demonstrated experience in devising solutions to difficult problems involving numerous constraints using commercially sound judgment You are an excellent communicator and understand that being a Product Manager is being a translator, influencer and negotiator.   For more information on this exciting opportunity and others I have coming up in the Product Management space please contact Olivia on 0468 918 176 / olivia@blackroc.co or Sophia on 0450 551 511 / sophia@blackroc.co at BLACKROC quoting reference: 950753"
    ]
  },
  {
    "title": "Senior Product Manager",
    "url": "https://www.seek.com.au/job/58505985?type=standout#sol=508a5523adf4a3e5004f3627d6519e9b2c154fcb",
    "description": [
      "About the Role\n\nA fantastic opportunity exists for a Senior Product Manager to join our high performing Transactional Banking team in BOQ Business!\n\nWith the flexibility to be based out of our Brisbane, Sydney or Melbourne office, we are looking for an experienced product manager ideally with a specialised knowledge of Electronic Banking infrastructure, payment network and interchange arrangements. \n\nThis varied role will hold accountability for the performance of the Credit and Debit Card portfolios and other business transaction products.  \n\nSome of your key duties and responsibilities will include the following:\n\nIntegrate the strategic, tactical and operational delivery of customer needs led product propositions.\n\tProvide management information on performance and history across the product suite\n\tWork with teams across the business to ensure the delivery of agreed product development, enhancements and campaigns to meet evolving customer needs and to drive profitable growth.\n\tEnsure compliance with internal policies and external regulations.\n\tManage key vendor relationships covering commercial terms, product development, compliance, marketing, portfolio growth and acquisition initiatives\n\tManage relationships with Schemes and strategic vendors.\n\tAssist in the execution of the Deposits Strategy and the end to end management of the deposit account suite.\n\tLead and influence a variety of small to medium initiatives to ensure project outcomes, customer and business benefits are realised.\n\tWork with internal teams to build relevant reporting and analytics around portfolio performance.\n\tManage the risk of the product set including regular monitoring of adherence to policies and providing input to annual product reviews.\n\n\nAbout you\n\nOur successful candidate will exemplify the BOQ Group values of Spirited, Optimistic, Curious, Inclusive, Accountable and Lionhearted to contribute to the purpose of Building Social Capital through Banking!\n\nWith relevant tertiary qualifications, you will ideally have a strong background in Product Management, coupled with specialised knowledge of Electronic Banking infrastructure, payment network and interchange arrangements.\n\nNaturally, you will demonstrate highly developed analytical skills, with top tier problem solving abilities. It would be great if you have experience working with distribution channels, as well as previous knowledge working with card or payment related industries (e.g. transactions switching, credit card schemes.)\n\nWorking with a variety of stakeholders across the bank you will have exceptional communication skills and the ability to build rapport across a diverse range of personalities.\n\nIf the above sounds like you we’d love to hear from you!\n\nAbout Us\n\nBOQ is one of Australia’s leading regional banks and provides a genuine alternative for Australian financial services customers and employees. Our purpose is to create prosperity for our customers, shareholders and people through empathy, integrity and by making a difference. Our ambition is to be known as the bold challenger bank; with multi-brands that are digitally enabled with a personal touch.\n\nBOQ is passionate about providing opportunities for you to develop your career as we continuously adapt and deliver in a transformational and collaborative environment with a strong focus on community.\n\nBOQ’s Inclusion vision is to foster a workspace that values and leverages difference and creates new possibilities, a place where our people feel confident to bring their best selves to work every day. We embrace difference and believe that our workforce should reflect the customers and communities that we serve.\n\nIn 2021 BOQ Group was awarded a Workplace Gender Equality Agency (WGEA) Employer of Choice for Gender Equality citation.\n\nOur Benefits\n\nFlexible working arrangements\n\tDiscounted financial products\n\tSalary sacrificing options\n\tPaid parental leave with no minimum\n\tPaid volunteer days\n\tPurchase annual leave\n\tBUPA Corporate Plan\n\tEmployee Assistance Program (EAP)\n\tA ‘zero tolerance’ to Domestic and Family Violence (DFV) with active support for employees experiencing DFV\n\tAccessible work support through various practices, systems, office adjustments\n\tGym, shopping, technology and travel offers\n\t5 employee diversity network groups focusing on; First Nations Reconciliation Council, Proudly ME (LGBTIQA+), Multicultural, Gender and Early Career.\n\tBOQ Group is a member of Pride in Diversity and a participating organisation in the Australian Workplace Equality Index.\n\n\nHow to Apply\n\nTo apply for this role please follow the links or apply via our Careers Page.\n\nThe Bank of Queensland is committed to diversity and an inclusive workforce. Aboriginal and Torres Strait Islander People are encouraged to apply.\n\nIf you are successful for a role with the Bank of Queensland, it is a condition of employment that background screening is completed to ensure that the Bank complies with its obligations under the Anti-Money Laundering and Counter Terrorism Financing Act. These checks may include, but are not limited to: identity, verification, reference checks, criminal background checks, immigration checks, verification of academic qualifications, bankruptcy checks.\n\n"
    ]
  },
  {
    "title": "Senior Manager Product Portfolio - P&SD",
    "url": "https://www.seek.com.au/job/58424432?type=standout#sol=4ad7b51dfaf5cbbbd7f9a65ad04822844abf48d9",
    "description": [
      "Senior Manager Product Portfolio Rio Tinto is building a world-class software engineering capability We are at the forefront of automation and intelligent mining. In keeping with our pioneering spirit, we’re building an internal software engineering capability focused on high value, strategic products that will enable the digital transformation of Rio Tinto. To accelerate us through this journey, helping us to expand our thinking, capabilities, and ability to deliver, we’re partnering with one of the world’s best software engineering companies. Do you want to join us on this journey to digitally transform Rio Tinto? Right now, we are a small, multi-cultural and diverse “start-up” team, who are inclusive and committed to building and scaling a deeply engaged, fulfilled and high-performance software delivery team. We have a culture of inclusion, agility, innovation and learning curiosity where our people work on engaging opportunities and problems that build the digital future for Rio Tinto and help the world progress.  About the role The Senior Manager Product Portfolio reports directly to the General Manager of Products & Software Development, leading the product ownership stream. In this role you will build a product ownership and portfolio capability.  The Senior Manager Product Portfolio is responsible for both product planning and internal product marketing ensuring establishment and widespread recognition of a product “marketplace”. Coordination of the Product Owner team in managing the products throughout the Product Lifecycle, gathering and prioritizing product and customer requirements, defining the product vision, and working closely with engineering teams, to deliver valuable products. It also includes working with the wider Rio Tinto organisation on the Portfolio Management processes to ensure that the most valuable work is being prioritised and that revenue and customer satisfaction goals are met.  Specific accountabilities include;  Defines the portfolio vision, strategy, and roadmap, accountable to develop and maintain the P&SD portfolio and integrate with the broader organisation for future development. Builds new products, and implements new ideas, identifies business needs and solves problems that ultimately bring added value. Builds a ‘marketplace’ of Platforms/Products for the business to start using products and have an integrated approach as a long-term goal. Defines, supports and builds the development and practice maturity of Product Ownership so that the business service and value statements define the valuable business problem(s), priorities and justifications for new and existing products. Leads the practice of user experience, user interface and business analysts (supporting product owners) Works closely with delivery and engineering teams to ensure business case and customer satisfaction goals are met.  About you You will bring a deep career experience where you have performed to a high level in a value driven environment and have defined and launched products that meet and exceed business objectives. You build, grow and lead your teams with a commitment to inclusion, innovation excellence, growth and caring for people. You have a passion for delivering digital assets or products that deliver ongoing superior value, and for being on the journey to product management. You may have worked within numerous digital transformations, and you will appreciate that transformation challenges don’t come in perfect sizes nor are smooth, and so are energised by the opportunity to create tomorrow within a team committed to doing the same. A few other things to consider;  Understanding and in-depth experience in modern product practices. Strategic thinker and leader. Very strong partnering and negotiation skills with a capability to influence senior stakeholders. Proven ability to influence cross-functional teams. Bachelor’s degree level or holds a relevant professional qualification and may have a postgraduate qualification such as an MSc, MBA, or other appropriate business, engineering, scientific or industry qualification.  What we offer  Be recognised for your contribution, your thinking and your hard work, and go home knowing you’ve helped the world progress. An excellent base salary reflective of your skills and experience with annual incentive program. Comprehensive medical benefits including subsidised private health insurance for employees and immediate family. Attractive share ownership plan. Extensive salary sacrifice & salary packaging options. Career development & education assistance to further your technical or leadership ambitions. Exclusive employee discounts (banking, accommodation, cars, retail and more) Domestic relocation if required.  Every Voice Matters At Rio Tinto, we particularly welcome and encourage applications from Aboriginal and Torres Strait Islander people, women, the LGBTI+ community, mature workers, people with disabilities and people from different cultural backgrounds. Come and join us in this exciting journey as a member of the leadership team, where you be integral in establishing and executing on our strategy, building our team, implementing best practices and technology to meet our plans for scaling and value delivery. Please note, in order to be successfully considered for this role you must complete all pre-screening questions."
    ]
  },
  {
    "title": "Product Manager - Platform",
    "url": "https://www.seek.com.au/job/58565655?type=standout#sol=6310d29701bb44a1aaed40a79684dade00a94b97",
    "description": [
      "Our flexible working and remote-friendly culture allows the successful applicant to perform the job from anywhere in Australia or New Zealand.  About the Role Compono is one of the world’s leading providers of intelligence-based people technology - enabling organisations to Engage, Hire & Develop the best talent. With an impressive and quickly expanding client base, Compono SaaS solutions put intelligence at the heart of businesses globally, enabling smarter hiring decisions, more effective learning, and better business outcomes!  We are now seeking a Product Manager to focus on User and Organisation Management, that serves the entire platform and our full suite of products. This role will sit across our Product, Engineering and Marketing functions and will be responsible for championing and delivering an experience that our customers love. You will be responsible for:     Delivering the Product Vision: You'll need to understand the broader Compono vision as well as have a good understanding of all products in our portfolio.  This will equip you to incorporate, manage, prioritise and communicate outcomes (value) effectively.     Product Management: You will plan and drive the product roadmap for User and Organisation management, ensuring all team members understand what they need to deliver and why it is valuable to our clients.     Product Development: You will define user stories for features and collaborate with the Technical Lead to perform high level estimations. To support delivery, you will create success metrics and required supporting documentation.      Customer Feedback: You will directly engage with our clients (along with Design and Engineering), and review this feedback in conjunction with quantitative metrics, to build empathy of experience with our users.   Stakeholder Management: Constant communication to internal stakeholders is critical for this role. In addition, you will also be an organised and effective facilitator.      Reporting / Risk Management: As a team coordinator for your area, status reporting, risk identification as well as mitigation and resolutions will need to be constantly front of mind and be communicated to the relevant stakeholders in a timely manner. Your Super Powers: You are a passionate user advocate who values collaboration and team work and loves working in a fast paced and fun team! You will also have:      At least 5+ years in a Product Manager role or similar role    Experience working cross-functionally at a platform level. Bonus points if this is in relation to user and organisation management  A passion for technology and building beautiful products  Proven ability in writing quality business and technical documentation    Strong proficiency in requirements gathering and discovery, user research, case development and competitive audits     Solid experience engaging with, managing and collaborating with business stakeholders       Proven ability to decompose big complex problems into bite sized milestones in a systematic and logical manner     Obsessive about helping create the ultimate customer experience   About Compono Compono is a software company that unlocks the potential of people. For companies large and small, we provide intelligent solutions to find, Engage, Hire & Develop  people by uniquely harnessing the power of data, science and technology. Our flexible modular solutions harness the power of your people, driving greater productivity and competitive advantage. We are a tech scale-up, but we know what it takes to build a successful business. We’ve built our technology and products from the ground up using best practice approaches. Visit compono.com for more information. Why join Compono? This is your unique opportunity to join a company in its high growth stage. More importantly, be part of an environment where everyone is valued, where you are encouraged to generate your own ideas, have an impact on decisions, and own your areas! We are passionate about what we do but always with a close eye on work life balance. Join a team that is inclusive of all differences, celebrates successes and always continuously learns!        We work with your version of flexibly working      ESOP options      A culture built on trust and empowerment     We live and breathe our core values, and they guide the way we work:       Flexible Thinkers      Elevate Each Other      Serve with Passion      Own Our Actions      Forever Curious      Strive For Excellence  Come work with an amazing group of diverse team members before it is too late! Please contact Soraya Hosseini on Soraya.Hosseini@compono.com if you require further details.  We’re more than a team, we’re a family. We’ve created an environment built on honesty, openness and inclusiveness. We pride ourselves in providing equal opportunities to everyone regardless of race, origin, religion, gender identity, sexual orientation, age or disability status. We promise to do our best to accommodate everyone’s reasonable diverse needs to the best of our ability. If you have special needs and require assistance with your application, please reach out to info@compono.com. "
    ]
  },
  {
    "title": "Head of Product",
    "url": "https://www.seek.com.au/job/58297883?type=standard#sol=5c51514bab6d20b9b223aa7bf97d107d4be71cc3",
    "description": [
      "About the company:    A market-leading SaaS business in the mining and natural resources sector, this company is a true global leader, supporting major corporations. My client is looking to bring in a Head of Product with strong industry knowledge that can drive innovation and client relationships to take the company to the next level.    About the role:  Own, communicate and lead the product function Ensure product strategies align to broader business strategy, vision, and purpose Define and document product requirements and roadmaps for execution and sales Present to high-level clients to drive business growth Lead market research and position conversations to ensure viable products and balanced growth  About you:  Relevant experience in a similar role within the mining industry is highly regarded Experienced in building and leading product teams in a scaling product environment Strong strategic mindset – able to plan for the future Background and knowledge in SaaS is a big plus Excellent communication skills, this is a very client-facing role     If this sounds like you or someone you know, get in touch! If this role is not quite what you're looking for but you’re on the market for a new role, reach out anyway! I recruit specifically in this space and would be thrilled to help you find your dream job with one of my amazing clients!      Please note, only shortlisted applicants will be contacted.    Josh Bull | Talent Scout | UI, UX, and Product Design    0404 028 383 | josh@justdigitalpeople.com.au"
    ]
  },
  {
    "title": "Product Manager",
    "url": "https://www.seek.com.au/job/58510877?type=standout#sol=c8527705af430ee971768ac6d330288020db45ee",
    "description": [
      "MYP is an Australian success story, aligning a passion for purpose-led business and advocacy within for-purpose industries with innovative tech solutions in the community + disability NDIS + educational sectors that positively change the lives of people, to give them back time, control, and choice. Our platform provides cloud-based solutions for rostering, client management, case management, HR management, forms, document management + marketing. We are connected through the vision of positively changing lives and draw inspiration and motivation to love working in a business that cares as deeply for our people, and the people connected to and impacted by what we do. We are on a journey of high growth and as such looking for a new team member to add to our skills across product development, lifecycle, design and customer voice through the lens of Product Management. The Product Manager is a high-impact role that will bring the capability to continue to raise the bar. Reporting to the Chief Product Officer the Product Manager is critical in enabling MYP to positively change the lives of people, to give them back time, control and choice. You will do this by assuming responsibility for overall product roadmap strategy, coaching and mentoring the team for client-centred outcomes. You will be responsible for working with a cross-functional team to ensure high-quality outcomes through roadmap design and execution, project management and community engagement initiatives that emphasise product-led growth strategy and great user experience. Coming into this role you will drive and impact these Performance Objectives: Define and drive the product roadmap, leading and communicating the product vision, strategy and approach across the business, agile delivery squads and community members to ensure alignment on product strategy and roadmap. Lead ongoing product development using data-driven insights and an agile approach.Coordinate multiple complex projects in line with roadmap strategy. Working alongside and holding a range of stakeholders to account for the meeting of project deadlines. Prioritisation of key features within projects to deliver on expectations of clients in a timely manner that improves user experience, whilst partnering with key stakeholders, and managing relationships to ensure ongoing engagement in the product development lifecycle.Lead the ongoing conversation between the customer and the development teams as part of an effective and clear communication plan. Interpret the client need to the development teams and provide ongoing partnership with the development teams to champion the user experience.Engage in and drive critical decision-making outcomes that balance and weigh the opinions of multiple stakeholders, internal and external, advocating for the customer in line with roadmap and feasibility. Being able to simplify complex environments so that product is intuitive and user-friendly. Lead and facilitate internal and external stakeholder engagement, consultation, and negotiation on product development issues to ensure product suitability.Partner with industry leaders to build and maintain a depth of expertise and insight that is synthesised and communicated to key stakeholders. Understanding the problems that service providers face and developing both an intuitive and effective workflow around which to develop product around.Partner with aligned customer communities, conducting and leading community research to understand customer needs and opportunities. Use data synthesise to drive customer-centred decision-making. As the Product Manager you will have the unique ability to impact thousands of Community, Disability, NDIS and Education sector organisations. Enabling them to deliver services to their participants, clients and communities with ever-increasing and improving scale, efficiency, effectiveness and flexibility. As such it is critically important that you are connected to our mission and vision in order to see the true value of your impact in this role. If this sounds like the type of role and opportunity you have been seeking, I would love to have an initial conversation to explore alignment and expectations. Please provide your expression of interest to Adam Hart, adam.hart@armitage.com.au, 0466 797 155, or through the application function here."
    ]
  },
  {
    "title": "Head of Product",
    "url": "https://www.seek.com.au/job/58309140?type=standout#sol=5761d48a05fd235be5c2d0a01ae919d32e1a2d5b",
    "description": [
      "About the Company: This scaling product company creates market-leading workforce management software, that is solving problems within the mining sector. In collaboration with your team, you will get to solve highly complex problems with some of the smartest people in the technology industry. As an empowered member of the senior leadership team, you will explore the problem space and make decisions that positively impact the customer, with significant commercial uplift for the business, leading the way as their Head of Product.  About the Role:  This is a pivotal role for the business, working closely with the CEO and CTO to define the product strategy and take the product to the next level. You will build the product function and ship products that solve complex problems in a high-impact industry. You will be working with the leadership team to develop long and short-term product priorities and enable the software engineering team to bring the vision to life through iterative and agile methodologies. As a thought-leading Head of Product, you will uplift discovery operations and product best practice, and lead your team through the next stage of growth.    Key Responsibilities:  Define the product strategy, roadmap and execution plan for each product, adjusting to and aligning with their stage within the product lifecycle. Lead, define, represent and communicate the product strategy to all stakeholders while leading, uplifting and driving continuous discovery and product practices.  Oversee product lifecycle management from concept to launch of the product(s) across all products/product lines, from greenfield to the well-established.   Lead the process to perpetually collect qualitative and quantitative market and competitive product data and intelligence to feed into strategy, planning and product execution plans.  Conduct customer and user research to understand pain points, generate ideas and specify product features and requirements for current and future products. Drive product operations and implement rigour in product decision-making, ensuring the business is making data-led product decisions and roadmap decisions built for long-term productization.  Prioritise the roadmap effectivity and optimise the delivery of features that create the most customer value; as your product decisions are data-led you are able to present, with confidence and conviction your product decisions.     Lead and manage the Product Management team, providing them with direction, coaching, mentoring, and feedback to align and prioritise their work, maximise their potential and achieve team and individual goals and objectives. Represent the Product and promote products by advocating their value at customer and executive briefings, and within the Sales and Marketing functions.  Define and monitor key metrics for measuring product success and ensure these are aligned with the wider business goals.  About You:  10-15 years of experience in product management, managing commercial software products, in a complex domain, ideally within the mining sector.  Experience leading the Product Management function for an organisation, managing the full product lifecycle. A proven track record of taking products from inception through to high-growth and you can talk to the commercial success that you achieved.  High levels of business acumen, with a strong, strategic and commercial mindset, with the ability to develop informed product strategies that improve product performance Exceptional leadership and people management skills, having created and realised a product vision, product best practices and continuous discovery processes. You have a high level of analytical and quantitative skills, with the ability to use data and various metrics to develop an informed and factual business case. Data drive your product decisions  You are a massive user advocate, becoming intimate with their problem space, pain points and what's next in the industry for your customers.    You are able to build excitement within your team as a constant north star in the delivery of products and features. Your product and feature discovery practices are best-in-class and in turn, you are able to champion product best practices throughout the business.   For more information on this exciting opportunity and others I have coming up in the Product Management space please contact Sophia at BLACKROC on 0450 551 511 / sophia@blackroc.co or Olivia on 0468 918 176 / olivia@blackroc.co quoting reference: 960786  Please note a high volume of my roles are 'off-market' and not advertised on job boards so let's connect."
    ]
  },
  {
    "title": "Product Lead",
    "url": "https://www.seek.com.au/job/58481393?type=standout#sol=84fb2f60564124f888815cd2e28c766dc06345a4",
    "description": [
      "At WorkCover Queensland our vision is to be the best worker’s compensation insurer, to make a positive difference to people’s lives and to keep Queenslanders working. Our flexible work environment allows you to be your best every day and contribute to the big picture.\nOur organisation is made up of individuals who collaborate and seek to engage others, working together as One Team. We embrace diversity and value people who bring personal energy and authenticity to everything they do. If you’re someone with a strong values-oriented compass and you want to achieve sustainable outcomes, you will find a great community at WorkCover.\nOur Digital and Technology Group is growing to support WorkCover Queensland’s digital transformation. We are looking for capable, curious, collaborative individuals who are excited to be at the forefront of our journey and help deliver exceptional digital services for our people, customers, and stakeholders. We are recruiting for roles across digital delivery, architecture, engineering, service delivery and experience design and are searching for great communicators, technical specialists and agile thinkers to join our team.\nWe’re looking for a Product Lead to join the Platform Services team.\nThe Product Lead is responsible for ensuring products that form WorkCover’s experience platform continue to meet the needs and align to organisational strategy. This includes developing and delivering to the appropriate technical and functional roadmaps.\nThis role will be responsible for leading product and platform teams, supporting the design of WorkCover technical initiatives to ensure new solutions follow best practice, align with architectural and security principles and comply with all WorkCover standards.\nThe ideal candidate will have:\n\nTertiary Qualification and/or equivalent experience\nFive or more years’ experience in a product delivery or consultant role demonstrating technical leadership skills and delivering technology solutions that enable organisations to deliver to their strategy.\nExcellent analytical skills with the ability to take a holistic view across a range of domains\nDemonstrated ability to communicate complex technical information clearly both verbally and in writing\nUnderstanding of relevant products and platforms with an eagerness to learn about new and unfamiliar technologies that could enhance our ability to deliver\n\nA bit about us:\nWorking in a collaborative team environment within a supportive and engaged organisation, you’ll enjoy a hybrid work model, access to personalised learning and development opportunities and the holistic support of our health and wellbeing program. We offer industry competitive salaries, a generous superannuation scheme (including co-contribution) and study assistance. You can find out more about our Employee Benefits by visiting Working at WorkCover Qld. [link removed] How do I apply?\nPlease submit your resume and covering letter to Katie O’Connell, Manager Talent Acquisition with applications closing at 10am Wednesday 28 September 2022.  \nPre-employment checks will be conducted on all prospective employees. This will include a Police Check, Education Check, Reference Check and where appropriate a Visa Check. The information provided will be treated as confidential in accordance with the Information Privacy Act 2009 (Qld).\nWorkCover Queensland is committed to building a safe and respectful workplace, celebrating difference and where all of our people feel included. Through our Diversity Council Australia membership, Reflect Reconciliation Action Plan, Age and Work Strategy and profile as a Work180 Endorsed Employer for Women, we continue to strive to do better for all of our people, and the Queensland community.\nAboriginal and Torres Strait Islander people are encouraged to apply"
    ]
  },
  {
    "title": "Group Product Manager - Hire, Engage & Develop Products",
    "url": "https://www.seek.com.au/job/58397069?type=standout#sol=fd7f454c1e03d9ff4b98c24b49cef3865d2f5ff4",
    "description": [
      "Our flexible working and remote-friendly culture allow this position to be based anywhere in Australia or New Zealand. About Compono Compono is a HR SaaS company that unlocks the potential of people. From small companies to large enterprises, we provide intelligent solutions to attract, hire, develop, and engage people by uniquely harnessing the power of data, science and technology. Our solutions allow a businesses recruitment processes to find the right people that fit with their team, provide deep transformative learning experiences for skill development, and help employees reach their potential at work through advanced insights on the work culture and human behaviour. About the Role The successful candidate will be joining the Compono’s Hire, Engage & Develop Product team. This is a unique opportunity to be part of our Management Team and collaborate with our Chief Product and Technology Officer to define, articulate and manage the evolution of key product areas that form part of Compono’s overall vision! Your remit will include but not limited to the following: Deliver the Product VisionProduct Management & DeliveryProduct DevelopmentStakeholder ManagementReporting / Risk Management Some of the responsibilities would be (The full Position Description will be provided in the recruitment process): Production Vision Definition: Define the vision and strategy for the product(s) under your remit and with the approval of the CPTO (horizon 0 - 12 months).Product Roadmap Development: Develop and execute on the roadmap in alignment with the business and strategic goals under the review and approval of the CPTO.Product Alignment: Ensure there is alignment and consistency between all Compono Products.Product Team Management: Ensure Product Owners are delivering features within expected delivery timeframes by ensuring they have the resources required to deliver a project while providing prompt coaching and feedback.Market Research: Maintain an understanding of the current market and use this information to help guide product decisions.Product Development Prioritisation: Manage and prioritise Epics and the details in roadmaps to ensure a continuous flow of work is available in the development pipeline. Oversee the sprints and development of stories by the Product Owners.Team Management: Lead a high performing team by ensuring they are working productively and on schedule according to the product roadmap. Delegating work, supervising work produced and providing coaching and feedback wherever necessary.Risk Identification / Communication and Reporting: Collate risks identified from Product Owners, as well as any other identified and communicate these risks and issues to the CPTO in advance in order to collaborate and communicate resolution plans.  Your Super Powers Armed with an agile background, you will be obsessive about creating the ultimate customer experience and are able to deal with unknowns and build, implement and communicate better processes and standard operating procedures. You will be in your element in a fast paced and constantly changing scale-up and posses the following: A minimum of 5 years in a B2B SaaS Product Management roleExperience in managing people and leading teams including team building, fostering a positive learning culture and driving high performanceExperience in managing multiple products at the one time with changing prioritiesAbility to analyse, interpret and evaluate data insightsProven strength in writing quality business documentationProject delivery & scheduling and tracking experience within proven ability to deliver within scopeStrong reporting experience including against product roadmap, resourcing planning and risk reportingStrong experience engaging with and managing business stakeholdersKnowledge, understanding and experience in good practice UI / UX designExperience in a fast-paced environment using agile methodologiesObsessive about helping create the ultimate customer experienceBig Picture thinker whilst also paying attention to detailExperience in the implementation of online product developmentProven ability to decompose big complex problems into bite sized milestones in a systematic and logical mannerExperience and understanding of greenfield developmentA confident, assertive, innovative approach to Product Management and a drive to take accountability for project delivery  We are a tech scale-up, but we know what it takes to build a successful business. Our rapid growth and expansion is supported and underpinned by high profile investors. We’ve built our technology and products from the ground up using best practice approaches. Visit compono.com for more information. Why join Compono?  This is your unique opportunity to join a company in its high growth stage. More importantly, be part of an environment where everyone is valued, where you are encouraged to generate your own ideas, have an impact on decisions, and own your areas! We are passionate about what we do but always with a close eye on work life balance. Join a team that is inclusive of all differences, celebrates successes and always continuously learns!                       We work with your version of flexibly working        ESOP options                   A culture built on trust and empowerment               Be part of one of Australia’s fastest-growing HR SaaS scale-ups    We live and breathe our core values, and they guide the way we work:       Flexible Thinkers      Elevate Each Other      Serve with Passion      Own Our Actions      Forever Curious      Strive For Excellence  Come work with an amazing group of diverse team members before it is too late!   How to Apply We would love to hear from you! Don’t miss out on this opportunity and apply now by completing your profile in detail through the link below. This profile will help us to better understand who you are; the types of skills and work experience you have, the qualifications you hold and the work preferences and expectations you have. Completing this profile will also help you understand more about us and whether you think Compono is a good fit for you. We’re more than a team, we’re a community. We’ve created an environment built on honesty, openness and inclusiveness. We pride ourselves in providing equal opportunities to everyone regardless of race, origin, religion, gender identity, sexual orientation, age or disability status. We promise to do our best to accommodate everyone’s reasonable diverse needs to the best of our ability. If you have special needs and require assistance with your application, please reach out to info@compono.com. "
    ]
  },
  {
    "title": "Lead Product Manager",
    "url": "https://www.seek.com.au/job/58312193?type=standout#sol=861e847e0b88db964e188a4d84b47784557e31d6",
    "description": [
      "About the Company:  A growing EdTech scaleup, with a suite of products targeting schools, parents and students, they have experienced incredible growth to their user base and are looking for a Lead Product Manager to drive this growth to the next stage while developing and delivering new product offerings.   About the Role:  The Lead Product Manager will be responsible for the end-to-end management of their products, and deliver solutions that meet customer needs and bring value to the business. You will work with the leadership team to define and deliver the growth strategy, and directly influence the outcomes of the business.  Key Responsibilities  Clearly communicate on the prioritisation decisions: what problems are we solving, who are we solving them for and why it is worth solving now Drive product delivery according to clear timelines, while validating assumptions along the way. That is, adjusting as you go based on the continuous feedback and assessments Utilise an approach of continuous measurements and adjustments to ensure resources are always being utilised in the most effective way to drive the most value for the business Effectively analyse data and user research to define and shape the product strategy and objectives Lead a Product Team to deliver exceptional results according to clear timelines.    About You:  5-7+ years of experience as a Product Manager or Senior Product Manager in a SaaS / Edtech company  You can gather, prioritise and translate customer needs and business goals into successful product features that create real business outcomes.  You have in-depth analytical abilities and your metrics-orientation allows you to make and lead quality product decisions.  Experience with defining and measuring key business and usage success metrics to drive product success. Proven experience leading multi-platform, B2B or B2B2C products with both web and mobile applications Your are influential and are able to bring your product-led approach to this business, driving discovery-led practise  You are a true senior, with the ability to solve complex customer and business problems and have wins on the board.    For more information on this exciting opportunity and others I have coming up in the Product Management space please contact Sophia at BLACKROC on 0450 551 511 / sophia@blackroc.co  or Olivia on 0468 918 176 / olivia@blackroc.co quoting reference: 959280."
    ]
  },
  {
    "title": "Product Manager",
    "url": "https://www.seek.com.au/job/58401597?type=standout#sol=82a3cdf6a5d286ef011b83f8494633c5ab1f0354",
    "description": [
      "About the RoleReporting to the Head of Product, the Product Manager is a critical part of the Commercial Group. Leading by example you will drive the strategic and operational execution of the product vision, strategy and roadmap throughout the product lifecycle.As the primary product interface for the organisation for products under management, the Product Manager plays a central role in the overall product management, and pre and post-sales support through the provision of detailed knowledge, analysis, documentation and expertise to internal and external stakeholders. The Product Manager works as part of an Agile Scrum team to prioritise product features and backlog items. This is a full-time permanent opportunity based in our North Sydney or Toowong office with flexible working arrangements including working from home.About YouYou will have 3+ years direct product management experience ideally in a payments context, with an in-depth level of functional knowledge commensurate with this. This includes an ability to effectively understand, analyse and design product development priorities, and based on this develop a product vision, product strategy and roadmap that effectively balances business, technical, client and commercial priorities. You will also possess the majority of the following skills and experience: Formal qualifications in a relevant discipline such as Finance/Banking, Computer Science or relevant work experience.Demonstrated ability to provide effective strategic leadership at a business level.Well-developed written and verbal communication skills with the ability to build strong working relationships across all levels of the business, particularly end-users and technical subject matter experts.Demonstrated ability to effectively engage and work with a broad range of stakeholders to influence cross-functional teams to achieve outcomes, without formal authority.Sound analytical skills, commercially astute, a structured problem solver who is passionate about evidenced based decision making.Experience working within agile environments and delivery methods.About UsYou will be joining a company at the forefront of its industry, offering exciting career growth and a great working environment.Indue is a provider of a broad range of white-labelled and transactional products to commercial businesses in a B2B market. Our product and service portfolio includes gift and prepaid products, various debit and credit cards, fraud management services, and payment solutions such as direct entry, BPAY, chequing and recurring payments.Our competitive advantage is based on our commitment to consistently delivering real service, being flexible and innovative, and building strong partnerships with our clients. We value our people because we know our success depends on them. Visit our website at www.indue.com.au for more information.Please use the 'Apply Now' button below to submit your Cover Letter and Resume, demonstrating your relevant experience for the role.No agency enquiries - only direct candidates with full working rights in Australia will be considered. Candidates may be requested to complete a criminal history check and provide their COVID-19 vaccination status as part of our recruitment process."
    ]
  },
  {
    "title": "Head of Product",
    "url": "https://www.seek.com.au/job/58211824?type=standout#sol=90561474ec34032ec1bc32f240221e9e5175a5de",
    "description": [
      "u&u have been exclusively engaged by a global leader in the digital mining solutions space. Operating over 50 countries, with over 20,000 employees, this organisation solves surface and underground challenges with integrated technology solutions for planning operation and safety.Reporting into a Vice President based in Australia; the Head of Product drives the strategy and integration of operation solutions and is responsible for aligning product strategy to business strategy. You will be responsible for a $200mil (AUD) portfolio.Lead a team of remote product managers;Work with the team to develop detailed scopes;Prepare and present professional material to communicate business vision;Find efficiencies to reduce manufacturing costs; andMaintaining market awareness and conduct regular competitor analysis.To be successful in this role you will have:A Bachelor of Commerce / engineering or other related degree;Track record in software development, with Linux / C# / Ruby & relevant project software (MS Project. ProjTool);Excellent communication skills. (English and Portuguese applicants highly desired not essential);Strong leadership experience, at least 3 years; andExposure to hazardous industrial environments preferred but not essential.For more information please call Alistair Walsh at u&u on 07 3232 9189, quoting reference number 28979. Alternatively, to submit an application, please click below.Please submit your resume in Word format only."
    ]
  },
  {
    "title": "Product Delivery Manager (HELiO)",
    "url": "https://www.seek.com.au/job/58571467?type=standout#sol=45f3965433e2cd2ede6c1c3e68e3c99def92d818",
    "description": [
      " \n \nAt Flight Centre Travel Group our purpose is to 'open up the world for those who want to see'. Every day, we give people all around the world the opportunity to experience something really amazing – travel! \nAs the Product Delivery Manager you will work closely with Product Managers in helping define the roadmap and implement strategies to design, build and deliver initiatives that are focused on providing solutions that empower our consultants to be travel experts.\nWe work autonomously from anywhere and work collaboratively online or in the office to achieve our team goals.  If you'd like to join our fast-paced environment, live and breath product and love to bring ideas and concepts to life, please apply!\n \nDay to day:\n \n\nInitiate and actively participate in the product ideation and discovery activities to help shape delivery\nManage the product backlog, including prioritisation, grooming and defect management;\nWork collaboratively with a cross-functional, multi-disciplinary team to bring features, capabilities, and improvements to life in a continuous improvement cycle\nEnsure that the team builds and delivers the right thing\nContribute to the wider strategic vision and roadmap\nGather and document business and technical requirements\nManage multiple stakeholders within the delivery lifecycle\nConstruct and prioritize delivery processes to ensure that the development team is clear on what to work on next\nPlay a key role in Agile software development, including elaborations, estimations, planning, user story acceptance and release activities\nCommunicates the voice of the customer to the development team\nEnsure a quality product by working closely with team members throughout delivery\nYou will be an expert in your domain, live and breathe the product, and advocate for your users\n\n \nYour experience:\n \n\nExperience working in technical product management with direct experience writing requirements, understanding technical architecture & driving feature development with engineering.\n3 plus years industry experience in managing digital products\nTeam player mentality\nGenuine passion to learn from the people around you and a keen interest in growing within a company long term.\nStrong communication and collaboration skills\n\n \nLet's skip to the good part...\n \n\nFlexible work environment (Hybrid), work from home or our Global Head Office in Southbank, Brisbane\nTravel discounts and deals bookable through our internal team of travel agents\nDiscounted financial services\nOngoing training and professional development\nChance to attend Global conferences (Bali 2023)\nPaid Parental Leave  \nCorporate Health Discounts - access exclusive discounts on health insurance plans for you and your family with our partner, BUPA.   \nWe proudly support and advocate responsible travel, positive diversity practices, empowered giving, and conservation of natural resources and sustainability - Yep, our hearts are big, mushy and green.  \n\n\n \n\nWho we are:  \n \n\n\n\nProud to be part of the Flight Centre family - We do things a little differently around here. We do things the FCTG Way.  Our mission is to dominate the SME market, making the end-to-end travel experience faster, simpler and easier for our customers and to demonstrate ongoing value to decision makers, travellers and bookers.  \n\n\nWe have a unique culture and an irreverent DNA based on a proven mix of ideas, values, and ways of working that have helped shape our business over the past 40+ years.    \n\n\nAcross our brand, we take our business seriously but not ourselves. We take leaps of faith, have trust in our teams and work collaboratively and take ownership of our business to achieve our goals.    \n\n\nOur spirit of egalitarianism, irreverence and ownership defines the way we behave.  These are the three shared values that we place above all others. They help us make informed decisions and solidify our company culture. That’s the FCTG Way   \n\n \n "
    ]
  },
  {
    "title": "Product Manager - Commercial Enablement",
    "url": "https://www.seek.com.au/job/58352803?type=standout#sol=7b22baefa920e3005320c38decce3a34b82df075",
    "description": [
      "Product Manager - Commercial Enablement   As part of ARN, the recognised leader in audio in Australia, you have an opportunity to share your voice on the future of audio. Audio is booming and we are defining it. We are entertainers. We create moments that move people, and that people move to. We are investing in audio’s smartest advertising, experts, and innovations. This gives us unparalleled understanding of our audience and the content that moves them and helps us form quality connections with our customers. It’s our commitment to creating moments that move people that makes us memorable. ​ ​Why not come along and be part of our story? We are looking for a Product Manager to look after the Commercial Enablement portfolio for ARN. The role manages the project delivery, product continuity and enhancement of business technologies and processes that impact the commercial workflows. About The Role:     Develop & execute growth focused business solution strategies by leveraging the power of people & technology. Responsible for connecting and enabling the translation of these strategies into tactical and executable plans Manage the commercial enablement portfolio end to end, including Projects and level 3 Application Support. Lead and deliver components in a business end to end overhaul of the commercial workflow including – CRM, Order Management, Product Commercialization and Order Fulfillment. Working with current systems like Salesforce and expanding our business capabilities through automation, software integration and workflow efficiencies.  About You:      Ability to manage changing priorities and consistent ability to meet deadlines Excellent stakeholder engagement skills Ability to identify key technical and business problems, develop and deliver innovative and effective solutions Experience managing people Expertise in end-to-end project & product management  Our Culture: We have four behaviours that make up our \"Culture in Action\" which describe how we act every day to create a great place to work:     Aim High​ - We set big goals and work together ​to achieve them. Own It​ - We take personal responsibility for our ​actions and have a solutions mindset. Be Your Best Self​ - We create the environment we need ​to thrive. Make a Difference​ - We look for every opportunity to improve and we seek out diverse perspectives ​to help us achieve that.  Bring your skills, genius, and energy along on our journey, please press the APPLY button and upload your cover letter and resume!    ARN is a HT&E company. For more details, head to www.arn.com.au and connect with us via Instagram (@arndefiningaudio) and LinkedIn (LinkedIn /ARN) EEO Statement. ARN is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, colour, religion, sex, gender identity, sexual orientation, age, national origin, protected veteran status, disability or any other basis protected by federal, state, or local law. Disability Accommodation For individuals with disabilities that need additional assistance at any point in the application and interview process, please contact the People & Culture team at the relevant state office: https://www.arn.com.au/contact-us/"
    ]
  },
  {
    "title": "Product Manager",
    "url": "https://www.seek.com.au/job/58550733?type=standard#sol=ce9f2f979587d15993b4d384fd27f0a881624045",
    "description": [
      "We are seeking a highly motivated person to join our rapidly growing tech distribution company at our head office in Brisbane. Reporting to the General Manager your focus will be managing an entire product range and be the key point of contact for customer inquiries.Our ideal candidate has a high attention to detail, is resourceful and data-driven with a keen interest in technology products. Individuals with experience in a product management or recent business/marketing graduates should apply. Key Responsibilities:Work with vendors to develop and implement go to market strategies for consumer technology productsManage relationships with key stakeholders internally and externallyUse market trends, data analysis and industry insights to inform decisionsBe the product owner; train and educate sales team on productsLiaise with key dealer accountsNegotiate deals with vendors, resellers and national retail accountsOversee marketing and promotional calendar by brandRespond to sales inquiries and concerns by phone, electronically or in personHandle and resolve customer complaintsEnsure customer service satisfaction and good client relationshipsDirect requests and unresolved issues to the designated resourceOwnership of claims to be paid by vendor with monthly update to be provided to management on statusProvide quarterly business reports to management on sales, profit and market share per brandCommunicate and coordinate with internal departmentsMake sales calls to new and existing clients The successful applicant should also possess the following: Knowledge of sales principles and practicesKnowledge of customer service principles and practicesExperience in sales and or product managementIntermediate Microsoft Office, Strong excel skills requiredExperience using ERPs and CRMsKnowledge of administrative proceduresNumeric, oral and written language applications.Dynamic is an equal opportunity employer. Qualified applicants will be considered without regard to age, race, creed, colour, national origin, ancestry, marital status, or sexual orientation, gender identity or expression, disability, nationality, sex, religion, or veteran status."
    ]
  },
  {
    "title": "Proposition / Product Development Lead - Contract - Australia",
    "url": "https://www.seek.com.au/job/58548407?type=standard#sol=2041809f5d72e1e7f4da5264fa5859e267e8c2ac",
    "description": [
      "About the Company  Reputable & leading Australian organisation, responsible for improving the lives of citizens and residents all over the country. This company puts it's employee's and customers at the forefront, always looking to improve and provide the very best with excellent working conditions that encourages passionate workers to strive for success.  About the Role  The successful candidate engaged as the Proposition Development Lead will be responsible for bringing a customer focused approach to solving problems and opportunities, driving key actions within the Customer proposition crew. They will contribute to delivering road maps, driving unique products and services in the market.  Examples of day to day responsibilities include:  Leading end to end development of large, cross functional propositions including new and significant changes.Working with the strategy team to develop and developer end to end development briefsWorking with the CX & Design team to deliver design sprints and robust viability assessmentsDrafting Business casesProviding advice and coaching to squads on the end to end proposition development.Conducting commercial viability and building cases for investment in initiatives.Stakeholder Management About You  Experience in proposition design and development or product and portfolio managementA strong customer focus and ability to integrate customer insights into every stage of the proposition design and testing processEffective story tellingAbility to challenge team to see the customer centric visionExperience in the Health / Finance Sector (Desirable)Background as a UX Designer OR a Product Manager looking to develop their career. The Benefits  Professional Growth opportunityLocation can be flexible across all states6 Month contract with high extension possibilities$875 (including super / + GST) per dayFantastic, innovative and supportive culture & team.Work from home / hybrid workingState of the art offices  To apply, click the link and upload your current resume in Microsoft Word format only (.doc or .docx). If you would like to have a confidential discussion, please contact Cherry Harris - cherry.harris@davidsonwp.com, quoting ref no. JO-2209-112733. Want to know more about Davidson? Visit us at www.davidsonwp.com [link removed]  "
    ]
  },
  {
    "title": "Product Manager",
    "url": "https://www.seek.com.au/job/58479275?type=standout#sol=8649935f6a53f667555e7b77dcda9e622607ac94",
    "description": [
      "You are good at Purchasing, Pricing & Product Costs and New Product Development (NPD)You want to take the next step in your career with progression and supportYou live in the greater Brisbane area Star Outdoor is a Brisbane based company with a national presence that makes outdoor branding easy. For 17 years we’ve been assisting our clients to activate their brands and bring them to life on a wide range of products. We are strong advocates of sun safety and are passionate about providing high-quality branding solutions, for our clients and the communities they serve. In this role we are looking for someone who will:Manage Purchasing including:Raising purchase orders on suppliersCheck & approve all purchasing invoices including all freight invoices and input into / update NetSuiteControl of warehouse inventory including stocktakes, etc.Manage Pricing & Product Costs including:Set all prices for standard itemsSet all prices for custom itemsSet all prices for bulk order itemsIdentify New Product Development (NPD)Source new and /or alternate products and suppliersCost / Sell Price controlSample sourcing and setupProduct packaging and inserts for new and existing products"
    ]
  },
  {
    "title": "Product Manager",
    "url": "https://www.seek.com.au/job/58485391?type=standout#sol=7be6057335813c5afc5903a54cb53c95f2236aa9",
    "description": [
      "THE JOB FUNCTIONTo develop, implement and execute business and product strategy in accordance with the overall strategy of the ANZ business.  To develop consistent selling messages and tools to differentiate from our direct and indirect competition. To serve as the product line subject manager expert from both a business and technical perspective and ensure that strict time lines of delivery are met to ensure we are ahead of our customer requirements. To liaise and support our ANZ Regional Sales & Marketing Team to execute programs of significance to our market and business activities. THE DUTIESImplement Strategic DirectionIdentify opportunities and target segments based on competitive strengthsAssess feasibility of meeting target segments  needsMonitor competitive environment include product offerings and capacity utilizationsDetermine and support distribution methods to optimize market penetrationOptimize portfolio - routinely assess and rationalize product line skuAnalyze and recommend investments for ANZ expansion. Qualify return on investment Assess global programs’ localization probabilityIdentify new local programs to deliver growthManage, resolve and execute business’s needs relating to portfolioIncrease brand awareness proposal Product LaunchProject manage new product development – from research, inception to product launchGather data and research (pricing/competitors) Create training programsSource samplesConduct testing Create or coordinate CDMCommunications: Manage Resources/Business Unit SupportCoordinate product development, product launch and product introduction activitiesIdentify and coordinate elements critical to a project; lead functional groups including:  Research, Sales, Quality Assurance, EH&S, Manufacturing, Engineering, Logistics, Marketing Communications, Develop & execute distribution growth & retention tools.Recommend, advise and implement on pricing strategies and cost reduction measures to optimize profitability Centralize and maintain all product and customer segmentation databasesOptimize product portfolio - routinely assess and rationalize product portfolioTrack portfolio and time balance of product developmentsProvide support to S&OP forecast process. Review & validate demand.Develop relationships and professional networks within GCPSupport Selling TaskWork with cross functions team(s) and AP/Global Marketing Communications, develop advertising and promotional programs; manage budget for these materialsDevelop technical product performance literature and other promotional materialDevelop and provide technical training for employees including induction materials to practical demonstrationsCoordinate Subject Matter Experts from within GCP to provide product training to staff and customersDevelop and implement product training & strategy alignment programs for Sales & DistributionDevelop and update competitive analysis including “Go To Market” strategy, portfolio strength and selling messages.Organize seminars and attend related association meetings Implement training schedule for customersPrepare financial analysis for project bidding.TechnicalSupport R&D Manager and function when required (leave etc)Product testing when requiredAssist with Australian Standards testingSite visits with R&D Manager to develop technical understanding and knowledgeAsset Management SupportOptimize adjusted gross margin working with purchasing, Ops, R&D and other functionsOptimize sourcing with Supply Chain to maximize the profitability and take advantage of the costs (raw material, packaging, freight cost and conversion). Ensure Product mix is in line with product stewardship policies KEY QUALIFICATIONSFirm leadership. Ability to influence without direct reportsExcellent decision-making and problem-solving skillsBusiness acumen with a mindset for continuous improvement and productivityGood communication and team player skillsHigh Level excel skillsInnovative and passionate about the product lineClear and detail analytical mind. Use data to make decision.  EXPERIENCE AND EDUCATION5 years experience, of which significant part in related industry Working experience in MNCs in a matrix organizationSales and/or Distribution management experience desiredUniversity degree in a technical or business discipline and possibly a post-graduate business qualification. "
    ]
  },
  {
    "title": "Category Manager / Product Manager",
    "url": "https://www.seek.com.au/job/58550219?type=standout#sol=446b1ef3e121c19f5157464b491d5231c6d278bc",
    "description": [
      "OUR COMPANYWith our head office based in Brendale, North Brisbane, Yakima is dedicated to creating intuitive outdoor products that harness the spirit of adventure that connect you, your friends, family and all your favourite gear to your desired destination or activity.  Yakima is a world leader in designing and manufacturing automotive gear management and storage solutions which include vehicle roof racks, cargo boxes, platforms, rooftop tents, bike racks, mounts and so much more!  Yakima is dedicated to creating intuitive outdoor products to harness the spirit of adventure connecting you, your friends, family and all your favourite gear to your desired destination or activity.  Yakima is a world leader in designing and manufacturing automotive gear management and storage solutions, including vehicle roof racks, cargo boxes, platforms, rooftop tents, bike racks, mounts and so much more!At Yakima, you can make a difference. We foster an environment where we are passionate about our products, have fun at work and celebrate our achievements.  We share a strong sense of pride in our brands and have a passion for creating products that get people and gear outdoors to enjoy a healthy active lifestyle. We understand that true success is only achieved through a supportive and collaborative team environment.OUR OPPORTUNITYThe Category / Product Manager is responsible for effectively using product management methodologies to work closely with the team to deliver new product development and enhancements in our categories. This includes responsibility for the product roadmap, analysing consumer needs, current market trends and developing key potential partnerships.   You will play a key role in ensuring Yakima stays at the forefront of our segment of the automotive OEM and accessory market. You will be responsible for:Identifying opportunities in the market to support organisational strategic initiatives including category growth;Business case analysis of potential roadmap projects including sustaining current and new product initiatives;Preparing and presenting product briefs and specification documents for resourced roadmap initiatives for review by cross-functional project teams;Determining product pricing by utilising market research data, reviewing production and sales costs,  anticipating volume and costing special and customized orders;Sourcing of relevant products and working with manufacturers to bring those products to market;Post launch analysis of new products and assisting with product marketing strategies;Researching and recommending suppliers and performing product performance analysis;Leading, coaching and motivating the Product Coordinator to maximise potential.ABOUT YOUTo be successful in this role you will be able to think out of the box whilst still having attention to detail,  a genuine passion for our brands/products and the ability to work as a team player.  Key attributes include:Minimum of 2+ years of product management experience;Excellent project management and organisational skills;Demonstrated experience in planning, execution and delivery of product development strategies;Strong verbal, written and computer skills with the ability to liaise with stakeholders at all levels;Experience working within a fast paced and dynamic environment;Ability to exercise strong and mature judgement in both a technical and business environment;Integrity along with the ability to work autonomously or part of a team when required;Pragmatic attitude with proven problem solving skills and strong attention to detail;Valid Driver’s License and the willingness to travel when needed (and safe to do so);Above all a ‘can do’ attitude and a commitment to being part of a hardworking and successful team.Experience working in an aligned market including automotive and/or sports and leisure will be very highly regarded.WHAT WE CAN OFFER YOUYakima is a progressive and people-focused business which believes in developing and rewarding our people and their success.  Because we value our employees and their families, we offer an agile and flexible working environment with an emphasis on work life balance, and health and wellbeing.  You can expect an attractive salary package and as a valued employee you will have access to a wide range of exciting benefits, not least discounted products for yourself, family and friends.We are committed to recruiting, training and retaining high quality people.  If this role sounds like it’s made for you, we would love to hear from you!   We are keen to fill this role quickly, so don't delay in your application. Please apply with a current resume and a cover letter addressing your experience and skills against the criteria listed above.Yakima is an equal opportunity employer and we are proud of our diverse and open culture and people of all genders, nationalities and backgrounds are encouraged to apply.  Direct candidates only (no agencies). Must have unlimited rights to work in Australia."
    ]
  },
  {
    "title": "Senior Backend Software Engineer",
    "url": "https://www.seek.com.au/job/58509784?type=promoted#sol=c5fc02303b24e63a805203b54e6ce9dd97e83522",
    "description": [
      "A newly created opportunity exists for an enthusiastic and experienced Senior Backend Software Engineer to join a talented, close-knit, customer focused and passionate R&D team. This role will be working closely with subject matter experts to extend the Datamine CCLAS product features and create state-of-the-art innovations which will be adopted by thousands of users around the globe.  If you are looking for a new and exciting challenge with the responsibility and opportunity to exercise your initiatives, then you should contact us immediately. Role Responsibilities Fix prioritised defects from the Quality Assurance team.Work with other developers to deliver a high-quality product within the defined release scheduleMentor and guide junior team members to grow and improveAnalyse problems and provide solutions in a timely mannerCollaborate with key stakeholders to design and develop new CCLAS functionalityWork as an essential member of the team and achieve outcomes on time and budgetEnsure security, integrity, and confidentiality of all Datamine and Customer dataEssential Skills and ExperienceThe ideal candidate will be able to demonstrate the following:Excellent experience with Java5 - 10+ years experience in developing web productsBachelor’s degree or higher in Computer Science or related fieldSelf-starter, motivated and positiveAdept at application performance tuning and profilingSkilled in Object Oriented design (OO) Understanding of software design patterns and when to apply themExperience of the full Software Development Life Cycle (SDLC) resulting in a deployed productAbility to work effectively in a global team and communicate with people of different technical and cultural backgroundsDesirable SkillsExperience in modern front-end technologies (typescript, React, Angular)Experience in Groovy highly desirableExperience with AWS and Azure Experience with KubernetesExperience with J2EEExperience with LinuxExperience in Oracle and performance tuning a big bonus!Experience in Spring frameworkExperience with Maven and GitWhat we offerHybrid and family-friendly working conditions - we've been supporting work from home since pre-pandemic!A dynamic and flexible Agile working environment.An inclusive and people-first culture.Hackathons and annual developer conference attendance opportunities.Training and career progression opportunities within a global organisation.About DatamineDatamine is a world-leading provider of geological modeling and mine planning software. With offices in twenty countries, Datamine provides solutions ranging from exploration data management and orebody modeling to mine planning and scheduling to over 1,500 mining companies and consultants in over ninety countries worldwide. Datamine is growing both organically and through acquisitions. Our software solutions are supported from our twenty-six offices by our consulting and training consultants to ensure that we provide our clients with industry-leading support and expertise."
    ]
  },
  {
    "title": "Senior Frontend Software Engineer",
    "url": "https://www.seek.com.au/job/58509799?type=promoted#sol=fea0c7eecc95037e6c77de3ff1969b5496f87811",
    "description": [
      "A newly created opportunity exists for an enthusiastic and experienced Senior Frontend Software Engineer to join a talented, close-knit, customer-focused and passionate R&D team. This role will be working closely with subject matter experts to extend the Datamine CCLAS product features and create state-of-the-art innovations which will be adopted by thousands of users around the globe.  If you are looking for a new and exciting challenge with the responsibility and opportunity to exercise your initiatives, then you should contact us immediately.Role Responsibilities Fix prioritised defects from the Quality Assurance team.Work with other developers to deliver a high-quality product within the defined release scheduleMentor and guide junior team members to grow and improveAnalyse problems and provide solutions in a timely mannerCollaborate with key stakeholders to design and develop new CCLAS functionalityWork as an essential member of the team and achieve outcomes on time and within budgetEnsure security, integrity, and confidentiality of all Datamine and Customer dataEssential Skills and ExperienceThe ideal candidate will be able to demonstrate the following:Excellent experience with ReactGreat knowledge about Ant Design or other similar UI frameworksProficiency in TypeScriptGood understanding of testing utilities for React5 - 10+ years experience in developing web productsBachelor’s degree or higher in Computer Science or related fieldPositive self-starter, motivated to chase issues to find solutionsAdept at application performance tuning and profilingStrong experience in code reviews and finding red flagsUnderstanding of SOLID design principlesUnderstanding of software design patterns and when to apply themExperience of the full Software Development Life Cycle (SDLC) resulting in a deployed productAbility to work effectively in a global team and communicate with people of differing technical and cultural backgroundsDesirable SkillsExperience with AWS and Azure Experience with KubernetesExperience calling APIExperience with J2EEExperience with LinuxExperience in OracleExperience in Spring frameworkExperience with Maven and GitExperience with Agile/Scrum developmentKnowledge of laboratories and miningWhat we offerHybrid and family-friendly working conditions - we've been supporting work from home since pre-pandemic!A dynamic and flexible Agile working environment.An inclusive and people-first culture.Hackathons and annual developer conference attendance opportunities.Training and career progression opportunities within a global organisation.About DatamineDatamine is a world-leading provider of geological modeling and mine planning software. With offices in twenty countries, Datamine provides solutions ranging from exploration data management and orebody modeling to mine planning and scheduling to over 1,500 mining companies and consultants in over ninety countries worldwide. Datamine is growing both organically and through acquisitions. Our software solutions are supported from our twenty-six offices by our consulting and training consultants to ensure that we provide our clients with industry-leading support and expertise."
    ]
  },
  {
    "title": "Senior Software Developer",
    "url": "https://www.seek.com.au/job/58470923?type=promoted#sol=a145bdef37c4147c8512d67d1851e12a1153904c",
    "description": [
      "At Patient Zero we’re a development company, built for devs, by devs.  We've created an environment where developers can thrive, working in small cross functional teams - you won’t find any lone wolves here. Teams are autonomous and accountable, with the support of the whole company and community behind them. Believe it or not, we do this as a customer-driven business (trying to avoid that ‘consultancy’ word that generally has people believing we are something we are not). What this means is that we have learning opportunities coming out of our ears. We’ve got many interesting domains and technologies to work with – but fear not! We don’t want you to know every single language or framework that’s out there. We’re looking for Senior (and or Intermediate level) Developers within Brisbane (4000) or Sydney (2000) who like to work in small teams of 4/5 people and can:  Work collaboratively and creatively with your teammatesMentor experience to help the jnr members of the team to grow Be proactive, propose solutions and influence architecture decisions for the products we build Enjoy working on various aspects of software development: architecture, frontend, backend, automated testing, deployment, etc. Experienced in; React.js, Angular, Node, Java, .NET Core, SpringBoot About you.. You have loads of experience in a software engineering role (front & back-end a total advantage)  Have a strong background building React applications Experience in developing responsive front-end web and/or mobile applications using modern frameworksA master in creating visually rich, interactive, and responsive user experiences across multiple platforms Previous experience working in an Agile/Scrum environment What we offer A fun and inclusive culture An extra 10% incentivisation on top of your base salary to use across tech funds and personal projects (incubator)Paid certifications in our partnership programsA bunch of learning groups & a personal growth planning program to advance your careerFlexible working arrangements with hybrid work from home and our CBD officeWe also play hard and have many social events such as board game nights, wine tasting events and multiple company celebrations! We do love to celebrate our many successes.  NOTE: Only shortlisted candidates will be contacted. Interviews will be arranged as soon as possible for suitable candidates/applications. "
    ]
  },
  {
    "title": "Senior Devops Software Engineer",
    "url": "https://www.seek.com.au/job/58562509?type=standout#sol=03b67e9428cba0881495f68239e740662a574e19",
    "description": [
      "Based in Brisbane, the Senior DevOps Software Engineer is responsible for delivering software solutions that provide the capability to Shell Energy to implement its strategic plans as well as to flex to meet its future business goals.    The Senior DevOps Software Engineer and Agilist with skills and experience to work with several technologies and architectural approaches to uplift Shell Energy’s technical capability and remediate technical debt. The role will work collaboratively within an Agile Squad to create, support, and enhance products and areas of functionality it owns. The cradle to grave solution approach embraces our DevOps model and is delivered in alignment with our values and culture.   Major Responsibilites & Accountabilities: As a DevOps Software Engineer and in collaboration with your peers, you will ensure the following responsibilities and accountabilities are met:  Develop high-quality DevOps friendly software features, components, and modules which incorporate key cross functional requirements such as scalability, fault tolerance and security; Ensure your solutions have an appropriate level of unit, integration and/or functional tests; Support your team to remove technical impediments and pay down technical debt to meet the organisation’s quality standards; and Monitor and manage the hosted software service.  Knowledge, Skills & Experience: As a Senior DevOps Software Engineer you will demonstrate the following qualities: Excellent engineering skills across a range of technologies, with advanced skills in an area of specialisation. Specific skill areas include:  C# development skills, and Typescript or Python experience; Experience in: High Throughput Event Driven Systems; Designing and developing RESTful API’s; Cloud Environments (AWS preferred); Databases (SQL Server, NoSQL like DynamoDB); Modern engineering practices – branching strategies, test driven development, CI/CD, instrumentation; and Web UI framework like MVC, Blazor, React or Angular.Experience breaking down legacy monolithic systems to modern architectures; Creating reusable infrastructure as code solutions; Encouraging and building automated processes wherever possible; and Experience with cloud vendor CLI’s, Scripting Languages, Containers or Terraform is highly desirable.  Why join us?At Shell Energy we work in a culture of care and curiosity, and encourage innovation and collaboration. We support flexible working and embrace a diverse and inclusive environment, with people who are passionate about disrupting the industry and simplifying energy for our customers.  Guided by our three core values – respect, integrity and honesty – we focus relentlessly on delivering outstanding service and cutting-edge solutions to our customers.  We do this by employing the best people in the business, and empowering them to get on and do what they do best.    About Shell EnergyShell Energy is Shell’s renewables and energy solutions business in Australia, helping its customers to decarbonise and reduce their environmental footprint.    Shell Energy delivers business energy solutions and innovation across a portfolio of electricity, gas, environmental products and energy productivity for commercial and industrial customers, while our residential energy retailing business Powershop, acquired in 2022, serves more than 185,000 households and small business customers in Australia.    As the second largest electricity provider to commercial and industrial businesses in Australia, Shell Energy offers integrated solutions and market-leading customer satisfaction, built on industry expertise and personalised relationships. The company’s generation assets include 662 megawatts of gas-fired peaking power stations in Western Australia and Queensland, supporting the transition to renewables, and the 120 megawatt Gangarri solar energy development in Queensland.    Shell Energy Australia Pty Ltd and its subsidiaries trade as Shell Energy, while Powershop Australia Pty Ltd trades as Powershop. Further information about Shell Energy and our operations can be found on our website. https://shellenergy.com.au"
    ]
  },
  {
    "title": "Senior Backend Software Engineer",
    "url": "https://www.seek.com.au/job/58509784?type=standout#sol=0e035deecba4b4e1de3c936e7e0aa0e16b9f19d3",
    "description": [
      "A newly created opportunity exists for an enthusiastic and experienced Senior Backend Software Engineer to join a talented, close-knit, customer focused and passionate R&D team. This role will be working closely with subject matter experts to extend the Datamine CCLAS product features and create state-of-the-art innovations which will be adopted by thousands of users around the globe.  If you are looking for a new and exciting challenge with the responsibility and opportunity to exercise your initiatives, then you should contact us immediately. Role Responsibilities Fix prioritised defects from the Quality Assurance team.Work with other developers to deliver a high-quality product within the defined release scheduleMentor and guide junior team members to grow and improveAnalyse problems and provide solutions in a timely mannerCollaborate with key stakeholders to design and develop new CCLAS functionalityWork as an essential member of the team and achieve outcomes on time and budgetEnsure security, integrity, and confidentiality of all Datamine and Customer dataEssential Skills and ExperienceThe ideal candidate will be able to demonstrate the following:Excellent experience with Java5 - 10+ years experience in developing web productsBachelor’s degree or higher in Computer Science or related fieldSelf-starter, motivated and positiveAdept at application performance tuning and profilingSkilled in Object Oriented design (OO) Understanding of software design patterns and when to apply themExperience of the full Software Development Life Cycle (SDLC) resulting in a deployed productAbility to work effectively in a global team and communicate with people of different technical and cultural backgroundsDesirable SkillsExperience in modern front-end technologies (typescript, React, Angular)Experience in Groovy highly desirableExperience with AWS and Azure Experience with KubernetesExperience with J2EEExperience with LinuxExperience in Oracle and performance tuning a big bonus!Experience in Spring frameworkExperience with Maven and GitWhat we offerHybrid and family-friendly working conditions - we've been supporting work from home since pre-pandemic!A dynamic and flexible Agile working environment.An inclusive and people-first culture.Hackathons and annual developer conference attendance opportunities.Training and career progression opportunities within a global organisation.About DatamineDatamine is a world-leading provider of geological modeling and mine planning software. With offices in twenty countries, Datamine provides solutions ranging from exploration data management and orebody modeling to mine planning and scheduling to over 1,500 mining companies and consultants in over ninety countries worldwide. Datamine is growing both organically and through acquisitions. Our software solutions are supported from our twenty-six offices by our consulting and training consultants to ensure that we provide our clients with industry-leading support and expertise."
    ]
  },
  {
    "title": "Senior Software Engineer (Ruby on Rails)",
    "url": "https://www.seek.com.au/job/58446249?type=standard#sol=358cc7de8f0d64e3351f48762973cc48fb98ece7",
    "description": [
      "CompanyAs a pioneer in the Engineering Software space, this global organisation has continued to grow year on year due to their market leading products. They are headquartered in the US, have over 4000 employees and their products have been deemed by industry experts as some of the best solutions in the market. Due to growth, they now require a Senior Software Engineer with Ruby experience to join the team!This person can be based in either Melbourne, Sydney or Brisbane.Role & ResponsibilitiesWork on challenging problems, write high quality code and deliver world class solutions.Design and implement large-scale enterprise solutions.Design, develop and operate a full suite of microservicesActively participate in agile software development environmentSupport various stakeholders within the business from a technical perspective.Create architecture requirements and recommendationsWork closely with customers to ensure their solutions is delivered to the highest quality.Improve product quality, security as well as performance.Participate in design review sessions and peer code reviewMentor junior team membersSkills & ExperienceStrong communication skills both written and verbalExcellent problem-solving skillsObject Oriented Programming experienceDemonstrated experience with Ruby, SQL, HTML, CSSSelf-starter and highly motivated individual.Willingness to learn their solutionsBenefitsUp to $165,000 + super + benefits for the right candidate. Package depending on experienceIf this sounds like you then please apply now!To see more jobs and updates follow Kaliba on LinkedIn -https://www.linkedin.com/company/kaliba"
    ]
  },
  {
    "title": "Senior Software Developer",
    "url": "https://www.seek.com.au/job/58554337?type=standout#sol=c1165eb233c653d8b395bebdbe13ac4700674149",
    "description": [
      " AusCERT - Based at Long Pocket Campus2 year fixed-term positionClosing date: Monday 3 October 2022 at 11:00PM AEST (R-10393) About This Opportunity  The Senior Software Developer role is responsible for programming tasks within Australian Cyber Emergency Response Team (AusCERT). The AusCERT Analyst Team use a variety of open-source tools, tactical solutions, and some in-house developed systems. This role will be assigned one major project such as integration of several open-source tools, or an in-house web application to be used by the Analysts to deliver information security related services to members. On occasion the Senior Software Developer may be called upon to take a break from major projects, and work with one or more of the Analysts to deliver a short, tactical solution for a problem such as develop tools for analysing data for a particular incident or detection methods for a new vulnerability, for example.  All of Senior Software Developers are physically located with the Analyst team, and actively participate in information security training, knowledge sharing and general discussion. Automation and scripting tasks, ideas for relevant products and services for AusCERT's members are actively encouraged from all team members. Most products AusCERT delivers today have originated from ideas developed by past and current Senior Software Developers, Infrastructure Engineers, and Information Security Analysts.  For interested candidates, the role can contribute to the running of the world class AusCERT Cyber Security Conference including speaker and paper reviews. In addition, AusCERT team members are also actively supported to attend other information security events, as well as to interact with other CERTs and agencies within Australia and worldwide to maintain and develop relationships.  This position is subject to the University's Code of Conduct.  Australian Cyber Emergency Response Team (AusCERT) AusCERT is a not-for-profit, leading Cyber Emergency Response Team for organisations in Australia and nearby. Based at The University of Queensland, AusCERT helps members prevent, detect, respond to and mitigate cyber threats. AusCERT publishes vulnerability data, threat intelligence and other relevant resources for information security and IT professionals and remains on-call for members after hours. Formed in 1993, AusCERT is one of the oldest CERTs in the world.  The University of Queensland (UQ) is one of Australia's premier learning and research institutions. UQ is renowned nationally and internationally for the quality of its teaching and research and enjoys ranking in the top 100 universities globally. AusCERT leverages UQ's IT infrastructure for commodity-type resources and operates a bespoke environment for specialist CERT infrastructure and tools, internally supported by dedicated security system administrators. For further information visit our website www.auscert.org.au and www.its.uq.edu.au.  About You The successful applicants will show an active interest in information security and related technology topics. This role, although focused on software development, is heavily involved in the information security aspects of technology. It can also lead to later placement within the AusCERT Analyst team, if interested.  Applicants should demonstrate knowledge and experience with technologies such as Python (or another OO language), web technologies, version control such as Git and most significantly, secure coding standards.  The University of Queensland values diversity and inclusion and welcomes applications from all individuals meeting the selection criteria.  Essential CriteriaRelevant experience and/or education/training, such as industry certifications, a bachelor's degree with significant computing component, or relevant experience in line with the following essential selection criteria:Our core business is delivering cyber security solutions. You'll need demonstrable skills or experience in the secure software development life cycle model.We develop on Linux operating systems; you'll need sufficient knowledge and experience for effective development on this platform.We use Python, Django, design and maintain MySQL databases, use web services/JSON formats and perform some front-end development in \"Infrastructure as Code\" environments. You'll need detailed knowledge and experience in these, or an equivalent transferable skill in another language/framework.Team spirit and motivation; you'll need the ability to work in a small team of developers and take responsibility for projects from requirements gathering right through to implementation and ongoing maintenance.Excellent communication skills; you'll be working directly with business and technical stakeholders.Desirable CriteriaUnderstanding of Ansible or another configuration management tool and Git or equivalent code versioning toolShell scripting, knowledge of mail systems, and data parsing and analysisKnowledge of TCP/IP networkingUse of the Agile project management methodologyCSSLP (https://www.isc2.org/csslp/default.aspx) What We Can Offer This is a Full-time fixed term position for 2 years at HEW level 7.  The full-time equivalent base salary will be in the range $90,538 - $98,719.38, plus super of up to 17%. The total FTE package will be in the range $105,929 - $115,501 per annum.  For further information about UQ's benefits, please visit Why Work at UQ and review The University of Queensland's Enterprise Bargaining Agreement 2018-2021.   Questions?  To discuss this role please contact Mike Holm at m.holm1@uq.edu.au.  For application queries, please contact recruitment@uq.edu.au stating the job reference number in the subject line.  Want to Apply?  All applicants must supply the following documents for your application to be considered:Cover letter addressing the 'About You' sectionResumeTo satisfy pre-requisite questions and ensure your application can be considered in full, all candidates must apply via the UQ Careers portal by the job closing deadline or will not be accepted.  Please note that you will be asked to add all documents into the one upload box labelled 'resume', which is step one of the application form.  Other Information Work Rights: You must have unrestricted work rights in Australia for the duration of this appointment to apply. Visa sponsorship is not available for this appointment.  Background Checks: All final applicants for this position may be asked to consent to a criminal record check. Please note that people with criminal records are not automatically barred from applying for this position. Each application will be considered on its merits.  We value diversity and inclusion, and actively encourage applications from those who bring diversity to the University. Our Diversity and Inclusion webpage contains further information if you require additional support. Accessibility requirements and/or adjustments can be directed to recruitment@uq.edu.au.  If you are a current employee of the University, or hold an unpaid or affiliate appointment with the University, please login to your staff Workday account and visit the internal careers board to apply for this opportunity. Please do NOT apply via the external job board."
    ]
  },
  {
    "title": "Senior Programmer",
    "url": "https://www.seek.com.au/job/58487642?type=standout#sol=2ba99caaea4d1b60f638d994a2d55adfd50f713c",
    "description": [
      "Join one of Southest Asia's largest specialised clinic groups \n\nEstablished in 2003, City Fertility is one of Australia's leading IVF and fertility services group with 10 IVF clinics, 70+ consulting rooms and 50+ fertility specialists nationwide.\n\nCity Fertility Career Opportunities: https://www.cityfertility.com.au/about-us/career-opportunities/ \n\nWhat we offer:\n\nCompetitive salary and compensation\n\tEthical business model\n\tExtensive support networks\n\tPositive and safe workplace culture and environment\n\tParental Leave and Fertility Benefits Program \n\tProfessional development and career development opportunities\n\tAccess to an Employee Assistance Programs for physical, mental, social, family and financial support\nAll personal information received by CF will be stored, used and disclosed by us in accordance with our Privacy Policy.\nAbout the Opportunity\n\nThis is an excellent opportunity for an experienced and innovative  Full Stack Software Developer to join us in our corporate offices, which offer a great working culture, interesting and diverse projects, flexible and autonomous working environment.  We are going through transformation from legacy to state-of-the-art systems and need someone who can work in our close knit team on diverse and interesting projects with state-of-the-art code.\n\nAbout the Business \nCity Fertility joined the CHA IVF global network, which has a 35-year track record as world-renowned pioneers in reproductive medicine. Refer to our website www.cityfertility.com.au under the ABOUT tab for more information about City Fertility and CHA Medical Group.\n\nWhat we offer:\n\n• Ethical business model\n• Great team and support networks\n• Positive, flexible and autonomous workplace culture and environment\n• Professional development and career development opportunities (self paced and self-managed courses)\n• Ongoing career appraisals and recognition of career milestones achieved\n• Access to an Employee Assistance Program\n\nWe are committed to the development of our people and invest in ongoing training to improve performance, provide career development opportunities and offer competitive salaries.\nQualifications/Experience required:\n\nSolid understanding of SDLC \n\tExcellent command on the essential items i-e HTML/HTML5, JavaScript/jQuery and CSS and experience in front end frameworks highly regarded\n\tAt least 2+ years of experience in .Net/core and proficient in C#/VB and ability to write neat and clean code \n\tThorough understanding of versioning systems like team foundation and GIT\n\tUnderstanding of SQL i-e MSSQL queries, stored procs, functions, working with linked servers etc (is desirable but not essential)\nWhat you will bring to the role:\n\nAttention to detail \n\tGood communication skills, written and verbal\n\tStrong problem-solving skills\n\tInnovative and out-of-the-box thinker\n\tAble to comfortably work to tight deadlines with little or no supervision.\n\tMature attitude to developing communication with team members\n\tAbility to work to flexible timelines in order to meet deadlines.\n\tAble to grasp new technologies and keep up to date with changes.\n \n\nApplication process\n\nIf this is the job is for you, then apply through our company website recruitment portal via:\n\nhttps://www.cityfertility.com.au/about-us/career-opportunities/ \n\nwww.cityfertility.com.au > Contact Us > Careers Page\n\nClosing Date: 14 October 2022\n\nAll personal information received by will be stored, used and disclosed by us in accordance with our Privacy Policy.\n\nValid Australian visa with work rights - You must be legally entitled to work in Australia to accept this position and will be required to show proof of employability with a copy of your Australian visa advising of visa details and entitlements or Australian birth certificate. An Australian visa check will be completed on all successful candidates.\n\nCity Fertility is an equal opportunity employer - All facets of diversity are important to us and we endeavour to create an environment where everyone, regardless of factors such as gender, age, ability, race, ethnicity, sexual orientation, gender identification or religion, can contribute to our progressive business."
    ]
  }
]