[
  {
    "title": "Junior Full-Stack Developer",
    "url": "https://www.seek.com.au/job/58567329?type=promoted#sol=6f25655c280dd7cb50f307cf8fc25b4223fda16e",
    "description": [
      "Punterstech: Ascot, Brisbane, QLD 4007Junior Full-Stack Developer September 2022OverviewPunterstech is a start-up created to deliver business-to-business software technology that provides end-to-end turnkey solutions for the Australian wagering industry. The Junior Full-Stack Developer role will design and code backend and frontend components of the application and gain exposure to the latest technologies including Kubernetes, Go, React Native and Terraform.ResponsibilitiesDesign and code: the back end and front-end components of the applicationMonitor: the quality and performance of the applicationPropose and implement: new tools, best practices and methodologiesConfigure and manage: our cloud environmentsQualifications1+ year of commercial software development experience (preferably Go)Front end development experience (React, Vue.JS, Svelte)Sound knowledge of JavaScript, HTML5, CSS3Ability to diagnose and solve application performance problemsExperience with GitBachelor's degree in Computer Science or Computer Engineering"
    ],
    "keywords": [
      {
        "react": 2
      },
      {
        "javascript": 1
      },
      {
        "MERN": 0
      },
      {
        "figma": 0
      },
      {
        "node": 0
      },
      {
        "angular": 0
      },
      {
        "vue": 1
      },
      {
        "REST": 0
      },
      {
        "typescript": 0
      }
    ]
  },
  {
    "title": "Junior / Graduate Support Developer",
    "url": "https://www.seek.com.au/job/58572398?type=standard#sol=915b0232dd14b49e4c3da5ec041da042b37d31b7",
    "description": [
      "WorkGuru is a SaaS platform that handles job costing, inventory, quoting and invoicing for small and medium businesses.We are seeking a junior or graduate developer to assist with the development of the platform, support our clients, and be part of our journey as we try to take over the world.We're happy to take someone part time (min 25 hours) or full time, so if you're still studying, we might be a good fit.Working directly with the founders and the existing team, this role will focus initially on front-end development and client-support, with scope to grow into a full-stack, developer position for the right applicant.We have an office in Stones Corner, but the option to work partially from home is available to the right candidate once they're up to speed.As this role is customer focused, you must have good communication skills, and be confident in speaking to, presenting to (via screenshare) and emailing real people about their questions / issues. Our ideal candidate must have skills inJQueryCSS HTML.NET MVC & RazorFinally, this role is for a company providing services to small and medium businesses. We take our clients' concerns and business needs seriously and will move heaven and Earth to do what is right for them. If this sounds like a role you could be interested in, submit your resume and cover letter* explaining why you'd be a good fit, and in particular, how you want to help small business.*Applications without a cover letter, or a generic cover letter will be rejected."
    ],
    "keywords": [
      {
        "react": 0
      },
      {
        "javascript": 0
      },
      {
        "MERN": 0
      },
      {
        "figma": 0
      },
      {
        "node": 0
      },
      {
        "angular": 0
      },
      {
        "vue": 0
      },
      {
        "REST": 1
      },
      {
        "typescript": 0
      }
    ]
  },
  {
    "title": "Graduate Software Engineer",
    "url": "https://www.seek.com.au/job/58387801?type=standout#sol=c94f009db73ce5f32319479aa778f7afadf52373",
    "description": [
      "Why Tehnika?Tehnika is an Australian control systems and software engineering consultancy specialising in real-time monitoring and control systems.  As a small to medium sized company, innovation and agility is at our core.  We pride ourselves on our ability to deliver outstanding solutions to our clients; our services encompass the full lifecycle of system integration and software project delivery. The OpportunityWe are seeking an enthusiastic, passionate, and innovative graduate software engineer to join one of our high-performing project delivery teams in Coorparoo, Brisbane. This role will provide the successful candidate with a variety of learning and development opportunities, within a welcoming and dynamic team environment. At Tehnika, our graduates are highly valued and can expect to expand their technical knowledge, client relation skills and undergo mentoring from experienced developers.  Your Typical DayDeveloping software solutions for clients, from design and documentation to implementation and maintenanceCollaborating in a strong team environment using C# and .NETTesting and deploying system critical public facing softwareParticipating in team-wide discussionsInterfacing with third parties to develop cross-system integrationsSupporting critical systems via on-call roster (typ. once every 8 weeks)Slightly less typical site visits for intra- and interstate testing & commissioning Your BackgroundA Bachelor’s degree in software engineering or similarExposure to memory-managed (C#, Java, etc) languagesBasic networking knowledgeAbility to effectively communicate and excel within an agile team environmentPassionate learner with a keen interest in developing their software engineering skillsSelf-motivated and passionate about contributing to company growthAbility to view problems from a big-picture perspective Desirable SkillsExposure to C or other non-memory-managed languagesExperience with PLC or RTU programming and/or protocols Applications Close:  25th October 2022Position Commences: 1st February 2023 (flexible start date) In your submission, please include a resume, academic transcript and cover letter outlining why you are suited for Tehnika’s graduate role. Applicants who fit the requirements of this role will be shortlisted for an interview. Please note: shortlisted applicants for this position may be asked to consent to a criminal record check. Please note that people with criminal records are not automatically barred from applying for this position. Each application will be considered on its merits. Tehnika is proud to be an Equal Opportunity Employer."
    ],
    "keywords": [
      {
        "react": 0
      },
      {
        "javascript": 0
      },
      {
        "MERN": 0
      },
      {
        "figma": 0
      },
      {
        "node": 0
      },
      {
        "angular": 0
      },
      {
        "vue": 0
      },
      {
        "REST": 1
      },
      {
        "typescript": 0
      }
    ]
  },
  {
    "title": "Graduate / Junior Web App Developer",
    "url": "https://www.seek.com.au/job/58333372?type=standout#sol=9b009bcb0c41416416ae077dcfb334a6105e6593",
    "description": [
      "About UsaXcelerate is a highly reputable SaaS student management system designed for providers of vocational education and training. We provide a next-generation software suite that powers learning and assessment for millions of students throughout Australia. With a focus on data, design, and innovation, we are currently #1 in the market and are seeking further talent to enhance business growth, both domestically and internationally.About the RoleLooking to start your career in the software industry? This rare opportunity to join aXcelerate's development team may be the perfect fit for you. We’re looking for a Graduate/Junior web app developer to assist us in building out new features and products across our web and mobile platforms. You will have the opportunity to work on front-end, back-end or across the full-stack. This is a permanent position with the opportunity to move to mid and senior-level roles eventually.You will also collaborate and work closely with the Product and Design teams to produce world-class experiences for our users. Summary of Responsibilities: Produce high-quality, secure code in accordance with our standardsDocument code consistently throughout the development process Proactively bring issues and problems to the attention of the team and generating, proposing and implementing innovative solutions to solve them About YouRelevant tertiary qualification(s) in Computer Science / ITPassionate about all things software and developmentUnderstanding of version control tools such as GIT Experience creating software or undertaking projects in a team environmentExcellent communication skills and a willingness to learnNice to haveA portfolio or github with projects you’ve contributed toUnderstanding of the software development life cycleFamiliarity with issue tracking tools such as Jira would also be a plusExperience working and collaborating with Product Designers or UX/UI DesignersExperience working from design tools such as FigmaTechnical SkillsReact / React NativeNode.js / Serverless / AWS / SQLWhat’s on offer?Work across our web and mobile platformsGain experience in React, React Native, Node.js, AWS and moreReceive mentorship from experienced developers Opportunity for remote workJoin a company that values your personal and professional development by providing a large range of in house and external training opportunities as well as a $2000 professional development budgetBe provided with a unix based development machine (MacBook Pro as standard)Parking available on-site (we are located in Milton, close to the train station)Quarterly company social activitiesHow to ApplyAs this is a junior position, only candidates able to work full-time in our Brisbane office will be considered. Opportunities for working remotely will be available after your first 6 months in the role.Please submit your resume and cover letter in PDF format via the SEEK website. Applications without both documents in the requested format may not be considered.Our service provision is founded on values of the H.E.A.R.T.: Honesty, Empathy, Acceptance, Respect and Trust!Only persons with unlimited rights to work in Australia need apply.We are an equal opportunity employer."
    ],
    "keywords": [
      {
        "react": 4
      },
      {
        "javascript": 0
      },
      {
        "MERN": 0
      },
      {
        "figma": 1
      },
      {
        "node": 2
      },
      {
        "angular": 0
      },
      {
        "vue": 0
      },
      {
        "REST": 0
      },
      {
        "typescript": 0
      }
    ]
  },
  {
    "title": "Junior Programmer",
    "url": "https://www.seek.com.au/job/58484612?type=standout#sol=e4af96c7e0f830c69e42696ff3db3b5eec1a5c3b",
    "description": [
      "Join one of Southest Asia's largest specialised clinic groups \n\nEstablished in 2003, City Fertility is one of Australia's leading IVF and fertility services group with 10 IVF clinics, 70+ consulting rooms and 50+ fertility specialists nationwide.\n\nCity Fertility Career Opportunities: https://www.cityfertility.com.au/about-us/career-opportunities/ \n\nWhat we offer:\n\nCompetitive salary and compensation\n\tEthical business model\n\tExtensive support networks\n\tPositive and safe workplace culture and environment\n\tParental Leave and Fertility Benefits Program \n\tProfessional development and career development opportunities\n\tAccess to an Employee Assistance Programs for physical, mental, social, family and financial support\nAll personal information received by CF will be stored, used and disclosed by us in accordance with our Privacy Policy.\nAbout the Role\n\nThis is an excellent opportunity for a junior and innovative programmer to join us in permanent full-time basis in the corporate City Fertility head offices in Newstead.\n\nAbout the business\n\nOver 6,500 babies and countless smiles for more than 15 years.\nEstablished in 2003, City Fertility (CFC) is one of Australia ’s leading IVF & fertility service groups.  We provide seamless care across the full fertility spectrum, while ensuring the best possible chances of conception for our patients through our rigorous protocols and actively taking part in research projects and science-based treatments.\n\nCFC has recently joined the CHA IVF global network, which has a 35-year track record as world-renowned pioneers in reproductive medicine. This Partnership provides City Fertility with unique access to CHA and SMG’s globally renowned medical, operational, and research & development expertise.\nRefer to our website www.cityfertility.com.au under the ABOUT tab for more information about City Fertility and our partnerships with CHA Medical Group.\n\nWhat we offer:\n\n• Ethical business model\n• Positive and safe workplace culture and environment\n• Great team and support networks\n• Professional development and career development opportunities\n• Ongoing career appraisals and recognition of career milestones achieved\n• Access to an Employee Assistance Program\n\nWe are committed to the development of our people and invest in ongoing training to improve performance, provide career development opportunities and offer competitive salaries. City Fertility is an equal opportunity employer - All facets of diversity are important to us and we endeavour to create an environment where everyone, regardless of factors such as gender, age, ability, race, ethnicity, sexual orientation, gender identification or religion, can contribute to our progressive business.\n\nThe Opportunity\nCity Fertility are looking for a Junior Programmer who can assist in software projects. We are going through transformation from legacy to state-of-the-art systems and need someone who can work in team with other developers to write state-of-the-art code. \nQualifications\n\nBA/BS degree in Computer Science, Software Engineering or related field, or equivalent practical experience\n\tMinimum 1 years’ experience in C#/.NET framework\n\tFront-end JavaScript frameworks\n\tProducing high-quality code utilising unit testing framework and code review practices\n\tVersion control tools such as Git and TFS\n\tGood communication skills, written and verbal\n\tStrong problem-solving skills and attention to detail\n\tCapacity to work in Australia\nDesirables\n\nUnderstanding of SQL is desirable but not essential i-e MSSQL queries, stored procs, functions, working with linked servers, etc\nValid Australian visa with work rights - You must be legally entitled to work in Australia to accept this position and will be required to show proof of employability with a copy of your Australian visa advising of visa details and entitlements or Australian birth certificate. An Australian visa check will be completed on all successful candidates.\n\nPersonal Attributes\n\nInnovative and out-of-the-box thinker.\n\tAble to comfortably work to tight deadlines with little or no supervision.\n\tMature attitude to developing communication with team members\n\tAbility to work to flexible timelines in order to meet deadlines.\n\tAble to grasp new technologies and keep up to date with changes.\nApplication process\n\nIf this is the job for you, then apply through our company website recruitment portal via:\n\nwww.cityfertility.com.au > Contact Us > Careers Page. \n\nClosing Date: 14/10/2022\n\nAll personal information received by will be stored, used and disclosed by us in accordance with our Privacy Policy."
    ],
    "keywords": [
      {
        "react": 0
      },
      {
        "javascript": 1
      },
      {
        "MERN": 0
      },
      {
        "figma": 0
      },
      {
        "node": 0
      },
      {
        "angular": 0
      },
      {
        "vue": 0
      },
      {
        "REST": 0
      },
      {
        "typescript": 0
      }
    ]
  },
  {
    "title": "Graduate Software Consultant",
    "url": "https://www.seek.com.au/job/58368875?type=standout#sol=8e45432d696f915a0723ce4c8e8439897f758fe6",
    "description": [
      "About the RoleRPMGlobal is seeking a Software Engineering or Computer Science Graduate with an interest in Business Intelligence and data. The Graduate Software Consultant will be an integral member of multi-disciplined project teams providing services to multiple departments, with a specific focus on data, business intelligence and reporting. The role will be focused on the development, use and implementation of our operational mining software within our Operational Data team. The role is based out of the RPM Brisbane CBD headquarters.Key ResponsibilitiesSupport the RPM Software Consulting group.Critical data analysis and cleansing.Perform software related consulting activities.Respond to technical support requests.Develop reports based on analysis and findings.About YouYou will have:Tertiary Qualification in Software Engineering, Computer Science or Data Analytics.Ability to communicate well and build relationships with colleagues and customers.A high standard of written and spoken English language.An aptitude in learning new software applications.Must have the right to legally work in Australia.About RPMRPMGlobal is the mining industry’s leading advisory and consulting, enterprise technology and training provider and has been at the forefront of change and innovation in the mining industry for over 50 years.​​We advance the mining industry towards a safer, more efficient, and more sustainable future through the delivery of innovative software solutions and deep domain mining expertise. Guided by our underlying principles of mining expertise, innovation, and sustainability, we strive to create safer and more efficient operations for our mining customers.Our focus on providing advanced mining advisory and consulting, enterprise technology and training across the mining lifecycle, enables us to guide customers through the current and emerging challenges the industry faces worldwide. This includes helping them meet the shift in social norms and consumer and investor ESG-related expectations. Please, no agencies or recruiters."
    ],
    "keywords": [
      {
        "react": 0
      },
      {
        "javascript": 0
      },
      {
        "MERN": 0
      },
      {
        "figma": 0
      },
      {
        "node": 0
      },
      {
        "angular": 0
      },
      {
        "vue": 0
      },
      {
        "REST": 1
      },
      {
        "typescript": 0
      }
    ]
  },
  {
    "title": "Junior Java Developer",
    "url": "https://www.seek.com.au/job/58381803?type=standard#sol=f0c258eb52e18b11f191ebc5e7839a7148a3fdf3",
    "description": [
      " CBD Location Work From Home; Hybrid working arrangement!  $60,000k+ to 120,0000+super!  About the companyOur client is an international IT consulting firm that provides innovative business and technology solutions to Banking and Financial Services, Digital Commerce and Retail customers! They have a great culture of like-minded people all working towards the same goal of helping those they work for.The positionThis is a permanent role, and the position will see you making enhancements to an enterprise system to replace legacy components and improve the overall functionality of the system.  You'll be working with Java and JavaScript on customer-facing and internal-facing systems.Role Requirements  At least 3 months experience with Java Good experience with JQuery or other Javascript framework Experience working in an agile environment Experience J2EE development experience - Spring Framework, Core Spring, Spring MVC. Test-driven development Restful API's  This is a collaborative and friendly organisation that is looking to improve its system that helps make people's lives better across QLD.  With a great culture and excellent work-life balance, this is a fantastic opportunity for a passionate Java Developer! If this sounds like you, APPLY NOW, or contact Joanne.eng@pra.com.au for more information. "
    ],
    "keywords": [
      {
        "react": 0
      },
      {
        "javascript": 2
      },
      {
        "MERN": 0
      },
      {
        "figma": 0
      },
      {
        "node": 0
      },
      {
        "angular": 0
      },
      {
        "vue": 0
      },
      {
        "REST": 1
      },
      {
        "typescript": 0
      }
    ]
  },
  {
    "title": "Software Development Consultant - Graduate Program",
    "url": "https://www.seek.com.au/job/57609166?type=standard#sol=34e5e9c7024ce1cf8160afa4146049ab4d86c4ce",
    "description": [
      "If you have a passion for tech, a detail-oriented mind and you thrive in a fast-paced team environment, the FDM Graduate Career Program can help kickstart your dream career. Our long relationships with top-tier client partners allows a foot in the door that can be out of reach to many graduates, giving you the opportunity to add big brands on your CV.FDM is a FTSE 250 employer operating across Asia-Pacific, the UK, mainland Europe and North America. Over a 30+ year history, FDM Group has won many awards. In 2022 FDM has risen 5 places to #16 on the GradConnection Top 100 Graduate Employers and is again one of GradAustralia's Top 100 Graduate Employers.FDM is a company committed to diversity and inclusion, we celebrate difference because we want everyone to have equal opportunity to belong and grow in their career. We are active in creating a more gender-balanced workforce, with circa 33% of our senior management team and 31% of all employees identifying as female.In 2021 alone, we launched the careers of over 2,600 graduates globally. And we provide a wide range of opportunities for our consultants to work in technical roles alongside some of the world’s biggest brands including KPMG Australia, HSBC and Macquarie. A career where you are encouraged to meet your potentialWe are currently seeking candidates interested in building a career within Software Development – all degrees welcome.As the key creative, brainstorming masterminds behind all computer applications, software developers design, write, install, and test software systems that they have built for a company.This is an incredibly varied role for innovators and collaborators which involves understanding user needs, developing solutions that will solve a problem, provide entertainment or simply make life easier for its intended audience.FDM’s program will give you highly sought-after skill sets and experience in a technical role that requires high levels of expertise, opening a number of exciting career progression opportunities from Web Developer to Cloud Engineer and much more. What will my time at FDM be like?Your journey will begin with training out of FDM’s award-winning academy. Like all interviews and assessments, this is done remotely in response to Covid-19, to ensure the safety of our community.You will receive the chance to gain industry recognised qualifications, as well as mentoring and support throughout. After successfully completing your training, you’ll have the technical and professional skills you need to step into an integral position with one or more of our industry-leading, multinational clients in Australia during the two-year program. What will I offer FDM?Bachelor’s degree or higher, STEM major not requiredAn analytical, problem-solving mindsetExcellent communication skills and eagerness to build relationshipsPassion to work within the IT industry & the ambition to succeedAbility to commit to completing our full 2.5-year graduate program – whether eligible under a single visa or as an Australian citizen/permanent residentGeographic flexibility throughout Sydney and Melbourne to support our top-tier clients What will FDM offer me?Fully-funded, industry-recognised training and qualificationsKey employability skills development - including Microsoft Excel, CV writing, interview and presentation techniquesMentoring and ongoing support throughout your entire FDM journeySocial events and networking opportunitiesA foot in the door to some of the world’s most reputable organisationsSocial events and networking opportunities Give yourself a head start – seize this opportunityThe industry demand for tech talent is so hot, there has never been a better time to launch an exciting IT career. Remember, you don’t need to have studied a STEM subject, what matters is your passion and drive.Our next round of courses is about to take off, so make your application now and give yourself the competitive advantage. The FDM Recruitment team will take you through the process and guide you to the path of your successful tech career.The world is at your fingertips, the possibilities are unlimited - all you have to do is click apply. FDM embraces diversity and encourages applications from people with disability. Candidates will have the opportunity to request support or reasonable adjustments during the recruitment process in order to demonstrate their ability to meet the inherent requirements of the job."
    ],
    "keywords": [
      {
        "react": 0
      },
      {
        "javascript": 0
      },
      {
        "MERN": 0
      },
      {
        "figma": 0
      },
      {
        "node": 0
      },
      {
        "angular": 0
      },
      {
        "vue": 0
      },
      {
        "REST": 1
      },
      {
        "typescript": 0
      }
    ]
  },
  {
    "title": "Junior Full-Stack Engineer",
    "url": "https://www.seek.com.au/job/58519363?type=standout#sol=b6a79878c3c0b977b7120bf9e0094610eb15f941",
    "description": [
      "About your opportunity...\nFlight Centre Travel Group is looking for a Junior Full-Stack Engineer who is as passionate about delivering innovative solutions to delight our customers. \nThis is an exciting opportunity to build reliable, scalable solutions with a focus on delivering value to our customers. You will be working as part of a well-established team on our Omni Channel initiative. Our ideal applicant will be no stranger to working with agile software development, and has experience using appropriate agile methodologies and lean practices.\nWe value teamwork, and with us you will have the opportunity to work across multiple teams and contribute to our culture of engineering and operational excellence whilst also honing your skillet. \nTechnology fly's fast! Our people use their quick thinking expertise, and tenacity to figure things out and keep us moving forward. Our people are as agile as the solutions we put in place - if this sounds like you, APPLY NOW.\n \nWhat You’ll Do...\n\nDesign, build efficient, testable, and maintainable code with the right balance between solving the problem at hand and not over-engineering your solution\nWork across the entire end to end stack, front-end web applications using modern JavaScript libraries such as React, and backend microservices/APIs using Node.js and Java\nCollaborate in our cross-functional Product Management and Engineering teams to plan and deliver high quality solutions in a fast-paced, agile environment\nTake initiative and always look for ways in improving the quality of our solutions, code bases, technical debt, standards, processes, and best practices\n\n \nWho you are...\n\nExperience in software development, using modern JavaScript coding, testing and automation techniques to deliver end-to-end solutions\nExperience in building user-friendly, responsive web applications for desktop and mobile\nExperience in some of the following: TypeScript, React, CSS (JSS), Cypress and Jest\nPassionate about software engineering best practices and know what it means to ship high-quality code that is maintainable and extendable\nHighly collaborative team-player who thrives in a team environment without being adversarial and can also work independently\nYou have a growth mindset, embracing challenges to continuously improve and innovate\n\n \nWhat’s in it for you...\n\nGenerous remuneration structure & Employee Share Scheme\nTravel & Accommodation discounts, in-house financial & health services, access to internal 24/7 gym & End-of-Trip Facility\nOngoing training & professional development\nFlexible working environment, with WFH options available\nBrightness Of Future: Employees have the right to see a clear pathway to achieving career ambitions, and promotion and transfers from within are our preference\nGlobal career opportunities in a network of brands and businesses\nProud Corporate Social Responsibility platform through the Flight Centre Foundation, Responsible Travel Charter, and Brighter Futures programs\nPotential to attend Global Award Events (Global Gathering Bali 2023)\n\n \nWho we are...\nAt Flight Centre Travel Group, our vision is to open up the world for those who want to see.\nAs a global travel retailer, our people come from all different backgrounds, and our connections spread to the far reaches of the globe. Together, we are a family.\nWe offer genuine opportunities for people to grow and evolve. We embrace new experiences, seize all opportunities, and empower all our people to find their Brightness of Future.\nWe DREAM BIG through collaboration and innovation and are supported to make incredible ideas a reality. We deliver quality, innovative digital solutions to delight our customers and achieve our strategic priorities.\nIrreverence. Ownership. Egalitarianism. \n "
    ],
    "keywords": [
      {
        "react": 2
      },
      {
        "javascript": 2
      },
      {
        "MERN": 0
      },
      {
        "figma": 0
      },
      {
        "node": 1
      },
      {
        "angular": 0
      },
      {
        "vue": 0
      },
      {
        "REST": 0
      },
      {
        "typescript": 1
      }
    ]
  },
  {
    "title": "Junior Full Stack Developer",
    "url": "https://www.seek.com.au/job/58460486?type=standard#sol=de360de77d56a19cecc28465aa737561b52a894c",
    "description": [
      "At Dreamboat we are looking for developers & engineers to come and contribute to the development of our rapidly developing platform. The brief is simple:To qualify for this role you must have the following first and foremost:Great communication skills, visually, conceptually, diagrammatically - every way possible.Be an excellent, not just average team member with provable experience inside or outside the work environment of this fact.An aptitude for solving problems - engineering degrees or comparable experience of all kinds are highly regarded.An understanding of APIs, Productivity and Profitability improvement as a result of API collected business data. Must be an Australian citizen or have permanent resident status in Australia. Required:Experience with web front-end development (primarily HTML and CSS; Javascript is not really required)Basic SQL database knowledge/experience.PHP is also our critical base language - however you may learn this if you know python or similar scripting language - out implementation isn't overly PHP perfect. Ideally:You will have examples and or experience with your own products large or small.Experience with GIT & deployment Experience in finance and business analysis.Software testing and/or Machine Learning knowledge. The Roles:Are to help us get through out backlog, pushing code live hourly sometimes. The Challenges:Develop charting infrastructureBuild analytical toolsOptimise data engineering processesConnect to new API systemsImprove UI  About us:Dreamboat provides a productivity & profitability improvement service to large and small businesses drawing on various sources of data and our technology platform.We are growing rapidly every day and looking for talented individuals who want to learn, contribute and grow with us, so please apply today and come on the journey with us.For a confidential discussion, please contact Chris, via chris.riddell@dreamboat.com.au N.B. We will accept all applications, full-time, casual & part time over the next 6 months."
    ],
    "keywords": [
      {
        "react": 0
      },
      {
        "javascript": 1
      },
      {
        "MERN": 0
      },
      {
        "figma": 0
      },
      {
        "node": 0
      },
      {
        "angular": 0
      },
      {
        "vue": 0
      },
      {
        "REST": 0
      },
      {
        "typescript": 0
      }
    ]
  },
  {
    "title": "Junior Full Stack Web Engineer",
    "url": "https://www.seek.com.au/job/58550728?type=standout#sol=408ca934e0c37e73e80e82975c8d2deeb49595c4",
    "description": [
      "Flight Centre Travel Group is looking for a Junior Full Stack Web Engineer who is as passionate about delivering innovative solutions to delight our customers. In this role you will help build solutions that make it simple and fast for customers to shop, book and travel collaboratively with expert consultants anywhere and anytime throughout their travel journey. \nWe value teamwork, and with us you will have the opportunity to work across multiple teams and contribute to our culture of engineering and operational excellence whilst also honing your skillet. \nTechnology fly's fast! Our people use their quick thinking expertise, and tenacity to figure things out and keep us moving forward. Our people are as agile as the solutions we put in place - if this sounds like you, APPLY NOW.\n \nWhat You’ll Do...\n\nDesign, build efficient, testable and maintainable code with the right balance between solving the problem at hand and not over-engineering your solution\nWork across the entire end to end stack, front-end web applications primarily using modern JavaScript libraries such as React, and backend microservices/APIs primarily using JavaScript/Node.js\nOwn the quality of what we build, through testing, test automation and observability to ensure operational reliability and performance\nBe a participant in the Flight Centre Community of Practice specialisations driving good development practices across the company\nCollaborate in our cross-functional Product Management and Engineering teams to plan and deliver high quality solutions in a fast-paced, agile environment\n\n \nWho you are...\n\nYou have experience in software development, using modern JavaScript coding and testing techniques\nYou have experience in building responsive web applications\nYou have experience with cloud technology\nYou’re passionate about software engineering best practices\nYou are a highly collaborative team-player who thrives in a team environment\nYou have a growth mindset, embracing challenges to continuously improve and innovate\n\n \nWhat’s in it for you...\n\nGenerous remuneration structure & Employee Share Scheme\nTravel & Accommodation discounts, in-house financial & health services, access to internal 24/7 gym & End-of-Trip Facility\nOngoing training & professional development\nFlexible working environment, with WFH options available\nBrightness Of Future: Employees have the right to see a clear pathway to achieving career ambitions, and promotion and transfers from within are our preference\nGlobal career opportunities in a network of brands and businesses\nProud Corporate Social Responsibility platform through the Flight Centre Foundation, Responsible Travel Charter, and Brighter Futures programs\nPotential to attend Global Award Events (Global Gathering Bali 2023)\n\n \nWho we are...\nAt Flight Centre Travel Group, our vision is to open up the world for those who want to see.\nAs a global travel retailer, our people come from all different backgrounds, and our connections spread to the far reaches of the globe. Together, we are a family.\nWe offer genuine opportunities for people to grow and evolve. We embrace new experiences, seize all opportunities, and empower all our people to find their Brightness of Future.\nWe DREAM BIG through collaboration and innovation and are supported to make incredible ideas a reality. We deliver quality, innovative digital solutions to delight our customers and achieve our strategic priorities.\nIrreverence. Ownership. Egalitarianism. \n "
    ],
    "keywords": [
      {
        "react": 1
      },
      {
        "javascript": 3
      },
      {
        "MERN": 0
      },
      {
        "figma": 0
      },
      {
        "node": 1
      },
      {
        "angular": 0
      },
      {
        "vue": 0
      },
      {
        "REST": 0
      },
      {
        "typescript": 0
      }
    ]
  },
  {
    "title": "Junior Full-Stack Developer",
    "url": "https://www.seek.com.au/job/58567329?type=standout#sol=f285de0bd065a3c1f04364efaf8ff635ffec37f1",
    "description": [
      "Punterstech: Ascot, Brisbane, QLD 4007Junior Full-Stack Developer September 2022OverviewPunterstech is a start-up created to deliver business-to-business software technology that provides end-to-end turnkey solutions for the Australian wagering industry. The Junior Full-Stack Developer role will design and code backend and frontend components of the application and gain exposure to the latest technologies including Kubernetes, Go, React Native and Terraform.ResponsibilitiesDesign and code: the back end and front-end components of the applicationMonitor: the quality and performance of the applicationPropose and implement: new tools, best practices and methodologiesConfigure and manage: our cloud environmentsQualifications1+ year of commercial software development experience (preferably Go)Front end development experience (React, Vue.JS, Svelte)Sound knowledge of JavaScript, HTML5, CSS3Ability to diagnose and solve application performance problemsExperience with GitBachelor's degree in Computer Science or Computer Engineering"
    ],
    "keywords": [
      {
        "react": 2
      },
      {
        "javascript": 1
      },
      {
        "MERN": 0
      },
      {
        "figma": 0
      },
      {
        "node": 0
      },
      {
        "angular": 0
      },
      {
        "vue": 1
      },
      {
        "REST": 0
      },
      {
        "typescript": 0
      }
    ]
  },
  {
    "title": "Junior .NET Developer",
    "url": "https://www.seek.com.au/job/58432310?type=standard#sol=13fc657b0a05b1e9e731cb12e1d9d2b5f7e5c79f",
    "description": [
      "Junior Software Developers! Looking to break into a fulfilling career surrounded by some of the most brilliant minds in .NET Core in Brissy? Look no further than this tight-functioning well-oiled business that is dominating their space. This Brisbane and Gold Coast-based business that offers remote first working is looking to take on multiple developers to nurture, mentor and build into a long-standing member of their family!Who are they?With nearly 20 years’ worth of experience, it’s safe to say this team and their product have finessed a beautifully constructed platform servicing the accounting industry. Their application provides smart solutions for accounting firms to easily manage their documents with integrated templates, intelligent reporting and benchmarking tools.Having a clear trajectory in terms of product development, they are looking to polish a product that has been kicking goals in the market for the past 24 months and needs additional minds to build it into an even bigger, better beast.The team & the workReporting to and working closely with Senior Developers based in Brisbane and the team’s Head of Product, you’ll be learning from top-tier individuals that live and breathe best practices. You will be working on the most modern tech stack in the market - .NET Core and Angular TypeScript to build out their core product’s features, and learn best practices and design patterns in how to build scalable, complex enterprise applications.The tech stack you will be across  .NET Core C# Front End Experience Ideal ( Angular)   Azure Docker and Kubernetes Visual Studio Bitbucket Jira Git Microsoft Office and Teams  In return you can expect  Flexible Work from Home arrangements Mentorship and guidance from Senior Developers to propel your career in tech Career advancement opportunities – the team are big on building and creating pathways within the business  Ready to kick off your career in tech in 2022? Let’s chat!Mike PattersonE – mike.patterson@affix.com.au"
    ],
    "keywords": [
      {
        "react": 0
      },
      {
        "javascript": 0
      },
      {
        "MERN": 0
      },
      {
        "figma": 0
      },
      {
        "node": 0
      },
      {
        "angular": 2
      },
      {
        "vue": 0
      },
      {
        "REST": 0
      },
      {
        "typescript": 1
      }
    ]
  },
  {
    "title": "Junior Front End Developer (Hybrid)",
    "url": "https://www.seek.com.au/job/58571220?type=standout#sol=d8ee3ef4beeb4be325f8cdec6f280dc9845cdb29",
    "description": [
      "Would you like to be part of building the best legal tech software on the market? Do you enjoy maintaining new and existing relationships with both internal and external stakeholders? Are you looking for an exciting technology start up feel, with the safety of a globally backed company? If you are nodding, then read on!  Work for a Culture that values its Employees.We are seeking an extraordinary and highly motivated JavaScript Developer/Integration Specialist to join our LEAP Family!  Reporting to the Project Innovations Manager, the role calls for maintaining new and existing relationships with both internal and external stakeholders. We practice strict regulations for integrations and need to ensure every line of code that we allow at an integration level passes strict vetting and best practices, there is a big emphasis on quality and communication.WHO ARE WE?LEAP is the global leader in the development of integrated productivity solutions for law firms with offices in Australia, New Zealand, United States, Canada, United Kingdom, and the Republic of Ireland.  We employ more than 800 people globally with more than 61,000 practitioners using our solution globally, enjoy all the benefits of a state-of-the-art legal practice management. As the world continues to adapt and grow, our cloud based legal solution is proving its value by helping law firms to work remotely anywhere to ensure their business continuity and efficiency.Our Team take pride in our Company Culture and share a genuine interest in how our solutions can positively impact our clients. We acknowledge their efforts with professional development, rewards, and recognition, and provide an array of excellent employee benefits! (Check out our perks & benefits below) WHAT YOU’LL DOReviewing new and updated integrations.Managing changes and required improvements across several RESTFul services.Working closely with key business decision makers and cross-functional development and testing teams to offer guidance and advice on what solutions will best fit the business needs.Working with QA personnel for advanced testing requirements.Sanity testing, approving / rejecting application reviews. Manage internal and external relationships, both in written and verbal aspects. Contribute to and create technical documentation.The candidate will be required to be a good cultural fit for our team as values and behaviours are important within our teams.  WHAT YOU KNOW AND HAVE DONE BEFORE JOINING US2+ years software development experience (JavaScript, Angular, Node)2+ year experience building REST services Experience in working in an Agile environment Experience in creating technical documentation specifications Strong verbal and written skills Strong delivery focus to complete tasks within schedule and quality standardsStrong problem-solving skills, analysis skills and attention to detailAs this is a permanent role it will only be open to candidates with Australian Permanent Residency or CitizenshipNICE TO HAVE SKILLSDatabase experience (mySQL, MSSQL and / or DynamoDB)Knowledgeable on best practices for both UI and UX developmentKnowledge of AWS productsKnowledge of OAuth and Auth0Experience working with json / yaml specifications  BENEFITS Friendly, supportive, and driven cultureComplimentary gym membershipFully stocked pantryWeekly massagesBreak out area and sporting activitiesMonthly celebrations for birthdays, work anniversaries, new joiners and passing of probationGenerous Parental Leave benefitsOne additional paid \"Be Me\" leave day per year to celebrate being you!Opportunity to participate in our Employee Share SchemeSee all of our benefits at https://www.leap.com.au/careers/ SOUND like a job you were born to do? We want to hear from you and can't wait to receive your application!At LEAP, we promote equal opportunity. Creating a culture of diversity and inclusion not only promotes innovation but we believe is the right way to do business. Our LEAPsters bring different cultures, genders and perspectives to their days and we wouldn't have it any other way. We welcome and encourage you to apply, no matter who you are or how you identify.…unless you are representing a third-party agency. Thanks for thinking of us, but we will not review any CVs from external recruitment agencies. Please note only shortlisted candidates will be contacted."
    ],
    "keywords": [
      {
        "react": 0
      },
      {
        "javascript": 2
      },
      {
        "MERN": 0
      },
      {
        "figma": 0
      },
      {
        "node": 1
      },
      {
        "angular": 1
      },
      {
        "vue": 0
      },
      {
        "REST": 3
      },
      {
        "typescript": 0
      }
    ]
  },
  {
    "title": "Junior-Mid Front End Developer",
    "url": "https://www.seek.com.au/job/58332514?type=standard#sol=d25c4e0060c58728e5e31ce2a9811610abb383b6",
    "description": [
      "JDP are excited to have partnered with a great company seeking a junior-mid Front End Developer to join their growing team. This role would have you join an organisation that is all about growth, work-life flexibility, and overall enjoyment in your day to day mission as a software engineer. The company itself has a focus on the communications industry and provides SaaS platforms for business' alike. They have had strong growth in their space and continue to exceed their expectations. As a result, this opening is purely based on growth with no plans on slowing.    The team genuinely care about your level of passion working on a particular platform and will check-in on a monthly basis to ensure you are satisfied with the work you are doing. Not satisfied? The team will make their best efforts to provide you with new challenges/platform to work with to ensure you are getting the most out of your professional life.     They boast a flexible WFH policy and mainly attempt to all group together once a week in their inner city Brisbane office to host a team lunch/whiteboard session for new innovations as well as host discussions about potentially better ways their tech can be delivered!    Overall, the team has a great structure to up-skill, nurture, and provide opportunities for growth across your career.     The Stack:  Ideally 2 years+ experience with React.js and/or Vue.js. Node.js is used for the BE so any understanding/experience is highly desirable.  Any experience with Python or Golang is also a bonus (but now were are getting into Unicorn territory!)  If you have a passion for front-end development, a desire to join a supportive team, and are looking for an opportunity for growth in your career, I encourage you to apply or contact me directly!    More than happy to share full details of the role, company, and product roadmap upon consideration of individual applications.    Aaron Mancy Software Development | Just Digital People 0435 416 770 | aaron@justdigitalpeople.com.au"
    ],
    "keywords": [
      {
        "react": 1
      },
      {
        "javascript": 0
      },
      {
        "MERN": 0
      },
      {
        "figma": 0
      },
      {
        "node": 1
      },
      {
        "angular": 0
      },
      {
        "vue": 1
      },
      {
        "REST": 0
      },
      {
        "typescript": 0
      }
    ]
  },
  {
    "title": "Junior Technical Analyst",
    "url": "https://www.seek.com.au/job/57297755?type=standout#sol=bb5689b9f5301df7eeb668cf19697b9f9a1a32c2",
    "description": [
      "Are you a mid-year finisher looking to launch your career in tech? The FDM Graduate Career Program can help you fast-track your dream career. Our long relationships with FTSE100 client partners allow a foot in the door that can be out of reach to many graduates, giving you the opportunity to add big brands on your CV. Grab this amazing opportunity to work with industry-leading companies including the top 4 banks, consultancies, insurance companies, retailers, and charities in Australia.A career where you are encouraged to meet your potentialWe are currently seeking candidates interested in building a career as a Technical Analyst – all degrees welcome. We have training start dates happening in June, July and August and throughout the year. If you're looking to start your career in technology, we want to hear from you now!About This RoleAlthough no prior technical experience is required, this is a role for a logical problem solver with a keen interest in technology. You ideally enjoy working with numbers, are a great team communicator and determined to succeed.Your reward will be an exciting and challenging role offering unlimited prospects for career growth and development. As a Technical Analyst, you will have the opportunity to apply your skills to innovative projects and make a real impact in a variety of sectors. You will be responsible for investigating and developing solutions for applications. It could be robotic process automation, quality assurance and IT infrastructure delivery for global businesses.The FDM Technical Analysis training program is designed to equip you with the skills and knowledge you need to start and grow a successful career. The 10-week industry specific training covers high demand skills such as SQL, Unix; Excel/VBA, BA, Python, ITIL, Cloud and OS-Admin.You’ll then set out on your career journey as an FDM consultant by working for one of our globally recognised clients. Junior Technical Analyst roles often involve high-profile projects in major financial institutions, working on sensitive information and gaining first-hand exposure to business operations. These opportunities are perfect for those who are team players with strong analytical skills and an aptitude for fast learning.About FDMFDM is a FTSE 250 employer operating across Asia-Pacific, the UK, mainland Europe and North America. Over a 30+ year history, FDM Group has won many awards. In 2022 FDM has risen 5 places to #16 on the GradConnection Top 100 Graduate Employers and is again one of GradAustralia's Top 100 Graduate Employers. In 2021 alone, we launched the careers of over 2,600 graduates globally. And we provide a wide range of opportunities for our consultants to work in technical roles alongside some of the world’s biggest brands.What will my time at FDM be like?Your journey will begin with training out of FDM’s award-winning academy. While interviews and assessments are done remotely, you now have the option to undertake training online or at our centrally located 21st floor Sydney office in Barangaroo.You will receive the chance to gain industry recognised qualifications, as well as mentoring and support throughout. After successfully completing your training, you’ll have the technical and professional skills you need to step into an integral position with one or more of our industry-leading, multinational clients in Australia during the two-year program.What we offer youCompetitive salary package and benefitsFully funded, industry-recognised training and qualificationsKey employability skills development - including Microsoft Excel, CV writing, interview and presentation techniquesA foot in the door to some of the world’s most reputable organisationsMentoring and ongoing support throughout your entire FDM journeyOption to do training in 21st floor Sydney office at prime Barangaroo location Social events and networking opportunities What will I offer FDM?Bachelor’s degree or higher, STEM major not requiredAn analytical, problem-solving mindset and passion to work within the IT industry with the ambition to succeedExcellent communication skills and eagerness to build relationshipsAbility to commit to completing our full 2.5-year graduate program – whether eligible under a single visa or as an Australian citizen/permanent residentGeographic flexibility throughout Sydney and Melbourne to support our top-tier clients Our cultureFDM is a company committed to diversity and inclusion, we celebrate difference because we want everyone to have equal opportunity to belong and grow in their career. We are active in creating a more gender-balanced workforce, with circa 33% of our senior management team and 31% of all employees identifying as female.Give yourself a head start – seize this opportunityThe industry demand for tech talent is so hot, there has never been a better time to launch an exciting IT career. Remember, you don’t need to have studied a STEM subject, what matters is your passion and drive.Apply now and give yourself the competitive advantage! The FDM Recruitment team will take you through the process and guide you to the path of your successful tech career.  FDM embraces diversity and encourages applications from people with disability. Candidates will have the opportunity to request support or reasonable adjustments during the recruitment process in order to demonstrate their ability to meet the inherent requirements of the job. "
    ],
    "keywords": [
      {
        "react": 0
      },
      {
        "javascript": 0
      },
      {
        "MERN": 0
      },
      {
        "figma": 0
      },
      {
        "node": 0
      },
      {
        "angular": 0
      },
      {
        "vue": 0
      },
      {
        "REST": 2
      },
      {
        "typescript": 0
      }
    ]
  },
  {
    "title": "Junior Intergration Engineer",
    "url": "https://www.seek.com.au/job/58314143?type=standout#sol=d03fb5897626bc9c063cf5f8abfc8208bad001d6",
    "description": [
      " M2i Electrical Services is an engineering business based in Murarrie, Brisbane.  M2i services marine and industrial clients throughout Australia and overseas and offer design, programming, manufacture, installation and commissioning services. We service clients in the superyacht and commercial marine industry across Australia, South East Asia and Europe.  We are seeking a Junior Integration Engineer to join our team on projects in Australia and abroad.Key ResponsibilitiesSupport engineering team and installation staff on multiple and varied projectsNetwork configuration and troubleshooting in the marine environmentNetwork configuration and troubleshooting in the industrial environmentSupport internal and external stakeholders completing network installation and fault finding The successful candidate will possess the following skills and experience: Undergraduate or Postgraduate Computer Science, Engineering (Software/Electrical/Mechatronics)Proficient use of Microsoft Word & Excel for system documentation Microsoft Windows Configuration and troubleshootingNetwork Setup and ConfigurationSimple IPv4 Network addressing and troubleshootingMinimum 2 years programing / scripting experience in any of the following; Python, C/C++, PHP, VB, Java, JavaScript, Pascal, Embedded Systems, Linux,Bash, PowerShell, etc.API InterfacingDesirable ExperiencePLC ProgramingLadder logic, Functional Block Diagrams, Structured TextMicrocontroller PrototypingArduino, Raspberry Pi / Pico etcProcedural & Objective programing methodsCAD ExperienceAutoCAD Electrical, Altium, Eagle etc.Data / System SecurityAV & Control systemsFamiliarization with AV standards and automation systemsHDMI, HDBT, DANTECRESTRON, AMX, SAVANT, RTI, CONTROL 4Instrumentation interfacing and protocolsRS458, RS232, Modbus, Analogue Signals (4-20, 0-10v), MQTT, OPCUA A full-time permanent role with the opportunity to join a privately owned business that highly value their employees, with an opportunity for both interstate and international travel. Full time, part-time and flexible working arrangements are available, depending on individual circumstances. The remuneration package will be discussed at the interview stage."
    ],
    "keywords": [
      {
        "react": 0
      },
      {
        "javascript": 1
      },
      {
        "MERN": 0
      },
      {
        "figma": 0
      },
      {
        "node": 0
      },
      {
        "angular": 0
      },
      {
        "vue": 0
      },
      {
        "REST": 1
      },
      {
        "typescript": 0
      }
    ]
  },
  {
    "title": "Graduate Podiatrist for Mentorship Program",
    "url": "https://www.seek.com.au/job/58231208?type=standout#sol=bc0ba8907db0948b0096e50965588932b4f77fa6",
    "description": [
      "Are you a graduate podiatrist looking for the perfect fit? Don’t miss out on this mentorship opportunity in Brisbane, Queensland. Advance Foot Clinic, a leading podiatry business with five clinics in and around Brisbane’s Northern and Western suburbs, is seeking a full-time graduate. What will the mentorship program look like?For our new graduates, Advance Foot Clinic provides comprehensive training and one-on-one mentoring. You will have a dedicated mentor that will provide support and guidance as you learn and enhance your skills as a podiatrist. We will ensure you are exposed to a range of podiatric complaints and that you are given the opportunity to explore and grow in your career. What’s in it for you?A wide variety of interesting podiatry cases, such as sports and biomechanics, surgery, diabetic care, paediatric care, NDIS, DVA, occupational and rehabilitation podiatry, general foot care and home visits.Excellent working conditions and a flexible roster.Access to leading 3D laser scanning technology for the manufacture of orthotics and AFOs.Utilise the latest treatment technology such as microwave therapy for skin lesions & cold laser clinical machinery for onychomycosis.Extensive support from the entire team utilising the cloud-based practice management software - PracSuite.Opportunities for career development in an environment that encourages and enables constant learning, growth and development.An attractive remuneration package to match your experience and qualifications.Reimbursement for AHPRA registration fees and professional indemnity insurance.A fuel and phone allowance and continuing education allowance.Good coffee, lasting friendships and a comradery no one can match. What will you do?The role will focus on providing a premium client experience to each individual patient, while growing and maintaining a loyal client base. You will need to take initiative, demonstrate excellent communication skills and work cohesively with the podiatry and administration teams to enhance outcomes and achieve business objectives. Your dedicated mentor will help you to understand and reach these goals.Be exposed to all areas of podiatryBe part of a supportive and dedicated team with excellent working conditionsEnjoy autonomy in a diverse role with a flexible rosterHave full administrative support and career development opportunitiesAdvance Foot Clinic will mentor you closely to ensure you continue to grow and learn. We focus on bringing out the best in our team members, because we know this will result in the best experience for our patients. What do you need?Relevant Podiatry qualification and intention to register as a Podiatrist as soon as possible.Love people and enjoy adding value to their lives.Be confident, driven and motivated.Have an interest in all aspects of podiatry and a thirst for learning and growth.Thrive in a fast-paced work environment and be able to multitask.Be able to work independently, but also willing to follow direction and take constructive feedback.Have great integrity and a good sense of humour. Brisbane Clinic locations: Arana HillsBellbowrieChermsideAshgroveThe Gap Advance Foot Clinic is an all-encompassing podiatry practice with clinics across various locations on the Brisbane Northside. We pride ourselves on the fact that we do more than just look after people’s feet; we look after their health and well-being. Apply now by emailing your resume and a cover letter which highlights your suitability for the role to careers@afootc.com.au with the subject “I want to be part of the team!”."
    ],
    "keywords": [
      {
        "react": 0
      },
      {
        "javascript": 0
      },
      {
        "MERN": 0
      },
      {
        "figma": 0
      },
      {
        "node": 0
      },
      {
        "angular": 0
      },
      {
        "vue": 0
      },
      {
        "REST": 2
      },
      {
        "typescript": 0
      }
    ]
  }
]